{
  "backend/main.mo": "Main actor for the ICP backend defining types (MathProblem, Submission, BookingRecord, etc.) and shared functions for booking management, UPI payments, math problem solving, and admin-gated operations like markAsPaid and getBookingRecords.",
  "backend/migration.mo": "Data migration module that upgrades BookingRecord from the old schema (no status/paymentConfirmedAt fields) to the new schema by defaulting status to #pending and paymentConfirmedAt to null.",
  "feature_evidence.json": "Feature evidence report mapping three implemented features (awaitingPayment booking flow, admin dashboard with mark-as-paid, completed sessions page) to their associated source files, components, and test IDs.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, serving as a reference index for the project's React components, hooks, and configuration files.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, chart, and sidebar color tokens.",
  "frontend/index.html": "HTML entry point for the Vite/React app with PWA meta tags, navy theme color, manifest link, and the title 'Rajat's Equation - Master Mathematical Thinking'.",
  "frontend/public/manifest.json": "PWA manifest for 'Rajat's Equation - Mathematics Platform' specifying app name, theme/background colors, icons, and standalone display mode.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and bypassing caching for ICP API calls, with install, activate, and fetch event handlers.",
  "frontend/src/App.tsx": "Root React component managing client-side routing between home ('/'), AdminDashboard ('/admin'), and CompletedSessions ('/completed-sessions'), with authentication state handling and profile setup gating.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component that displays all booking records in cards, allows filtering by status, and lets admins mark bookings as paid using React Query hooks.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component that intercepts click events and shows a login modal if the user is not authenticated via Internet Identity, otherwise passes the action through.",
  "frontend/src/components/BookingConfirmation.tsx": "Read-only confirmation screen shown after a booking is submitted, displaying booking details and a note that UPI payment is awaiting admin verification.",
  "frontend/src/components/BookingFlowManager.tsx": "Multi-step dialog manager that orchestrates the booking flow through form, UPI payment, and confirmation steps, saving the record to the backend on payment.",
  "frontend/src/components/BookingForm.tsx": "Form component for collecting booking details (name, phone, date, time, service) with validation, supporting both inline and dialog rendering modes.",
  "frontend/src/components/CompletedSessions.tsx": "Page component that fetches and displays all completed booking sessions in a card grid, with loading skeletons and error handling.",
  "frontend/src/components/CourseOffering.tsx": "Displays a course details card with pricing, features, and a UPI payment flow, fetching course info and user purchase status via React Query hooks.",
  "frontend/src/components/EnrollmentCTA.tsx": "Renders a call-to-action enrollment section with benefit cards, WhatsApp/YouTube links, and a booking flow dialog triggered by an auth-gated button.",
  "frontend/src/components/Footer.tsx": "Site footer with logo, auth-gated social media links (WhatsApp, Instagram, YouTube, LinkedIn), and navigation, accepting an onNavigate prop.",
  "frontend/src/components/Hero.tsx": "Hero header section with the site logo, tagline, and auth-gated action buttons for enrollment, program exploration, and Instagram, plus an admin dashboard link.",
  "frontend/src/components/LoginButton.tsx": "A toggle button that handles Internet Identity login and logout, showing a loading spinner during authentication and clearing the React Query cache on logout.",
  "frontend/src/components/LoginModal.tsx": "A dialog modal prompting unauthenticated users to sign in via Internet Identity, with a login button and a dismiss option.",
  "frontend/src/components/ProblemGenerator.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetup.tsx": "Onboarding form that collects a new user's name and saves their profile via a mutation hook, redirecting them into the app on success.",
  "frontend/src/components/ProgressTracker.tsx": "Empty file with no content.",
  "frontend/src/components/Services.tsx": "Renders a 'Courses & Pricing' section displaying six math courses in cards with group and one-to-one pricing, WhatsApp booking links, and an integrated BookingFlowManager dialog.",
  "frontend/src/components/UpiPaymentStep.tsx": "Displays a UPI payment step with a QR code (fetched from qrserver API via canvas), a copyable UPI ID, and buttons to pay via UPI app or confirm/cancel payment.",
  "frontend/src/config/razorpay.ts": "Empty Razorpay configuration file with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, reinitializing and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useBooking.ts": "Provides React Query hooks for adding a booking record (mutation) and fetching all booking records (query) via the ICP backend actor.",
  "frontend/src/hooks/useInstallPrompt.ts": "Custom hook that captures the browser's PWA install prompt event and exposes canInstall, installApp, and isInstalled state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity, and status state to child components.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for user profile, course details, UPI payment, booking records, admin status, and mark-as-paid operations.",
  "frontend/src/hooks/useRazorpay.ts": "Empty Razorpay hook file with no content.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Playfair Display, Inter), sets up Tailwind directives, and defines CSS custom properties for the navy/gold/cream brand theme in both light and dark modes.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/types/booking.ts": "TypeScript interfaces defining the shape of booking form data, booking records, and UPI payment parameters used throughout the app.",
  "frontend/src/utils/upiPayment.ts": "Utility module that exports the UPI ID/payee name constants, a function to generate UPI deep link URLs, and a helper to detect mobile devices.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with brand colors (navy, gold, cream), custom fonts, border radii, box shadows, and accordion animations, plus the animate and typography plugins.",
  "project_state.json": "Project state metadata document describing the tutoring booking platform's architecture, booking status flow (Pending → Awaiting Payment → Completed), existing implemented features, and known issues."
}