{
  "backend/main.mo": "Main actor for the Rajat's Equation platform defining all data types (MathProblem, Booking, Sessions, Attendance, etc.) and including mixins for storage, authorization, Stripe, and HTTP outcalls.",
  "backend/migration.mo": "Handles state migration from OldPersistentState (with `classSessions` using OldClassSession) to NewPersistentState (with `sessions` using NewSession that adds optional meetingPlatform and meetingLink fields).",
  "feature_evidence.json": "Feature evidence report mapping two features—admin meeting platform/link management in StudentDetailView and student-facing 'Join Class' button—to their implementing files and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated summaries of all frontend source files, describing each component's purpose, key hooks, and notable implementation details for build planning reference.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes including colors for background, foreground, charts, sidebar, and destructive states.",
  "frontend/index.html": "HTML entry point for the PWA with title 'Rajat's Equation - Master Mathematical Thinking', PWA meta tags, manifest link, and the React root div.",
  "frontend/public/manifest.json": "PWA manifest for 'Rajat's Equation - Mathematics Platform' specifying icons, theme colors, standalone display mode, and education/productivity categories.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and bypassing caching for ICP API calls, with install/activate lifecycle handlers for cache management.",
  "frontend/src/App.tsx": "Root application component that manages authentication state, admin checks, and view routing between home, admin dashboard, student portal, and other views using Internet Identity.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard with a sidebar navigation providing access to tabs for booked students, attendance, support messages, enquiries, course materials, class sessions, discount codes, and visitor tracking.",
  "frontend/src/components/AdminEnquiriesTab.tsx": "Admin tab component that lists all student enquiries with expandable details, allowing admins to confirm or reject each enquiry and view associated QR tokens.",
  "frontend/src/components/AdminSupportMessages.tsx": "Admin component that displays support messages grouped by student, with expandable threads and an inline reply form for responding to unreplied messages.",
  "frontend/src/components/AttendanceManager.tsx": "Admin component for marking student attendance by selecting a booking and recording present/absent status, with a view of recent attendance records for the selected student.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component that intercepts click events to enforce authentication, showing a login modal for unauthenticated users and passing through or calling onAction for authenticated ones.",
  "frontend/src/components/BookedStudentsSection.tsx": "Displays a searchable list of booked students with status badges, and allows drilling into a detailed view for each student via StudentDetailView.",
  "frontend/src/components/BookingConfirmation.tsx": "Renders a confirmation screen after a booking is completed, showing all booking details including name, service, date/time, discount, and total amount.",
  "frontend/src/components/BookingFlowManager.tsx": "Manages a multi-step booking dialog flow (form → payment → confirmation) by coordinating BookingForm, UpiPaymentStep, and BookingConfirmation components.",
  "frontend/src/components/BookingForm.tsx": "A form component for collecting booking details (name, phone, service, class type, number of classes, date/time) and calculating the price before submission.",
  "frontend/src/components/ClassSessionsManager.tsx": "Admin component for managing course sessions per course, supporting adding new sessions with meet/calendar links and deleting existing ones, sorted by date.",
  "frontend/src/components/CompletedSessions.tsx": "Displays a list of all completed tutoring bookings fetched from the backend, showing student details, session info, and optional access codes.",
  "frontend/src/components/CourseMaterialsManager.tsx": "Admin component for managing course materials (PDFs, videos, notes, links) per course, supporting add and delete operations via React Query mutations with a course selector dropdown and inline form.",
  "frontend/src/components/CourseOffering.tsx": "Displays a course details card with pricing and an enrollment button, and handles UPI payment submission via a dialog that records the transaction reference ID.",
  "frontend/src/components/DiscountCodeManager.tsx": "Admin panel component for viewing hardcoded and backend-fetched discount codes, generating new codes locally, copying them to clipboard, and deactivating existing codes.",
  "frontend/src/components/EnrollmentCTA.tsx": "Marketing section component that displays enrollment benefits, WhatsApp/YouTube links, and a booking flow dialog to encourage students to join Rajat's Equation.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand info, quick navigation links, contact details, and a Caffeine.ai attribution badge.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, desktop/mobile nav links, login/logout controls, and admin-aware routing using Internet Identity authentication.",
  "frontend/src/components/Hero.tsx": "Landing page hero section with math-themed visuals, call-to-action buttons for booking sessions and enquiries, and role-based navigation links for students and admins.",
  "frontend/src/components/LoginButton.tsx": "Standalone button component that handles Internet Identity login and logout, showing appropriate icons and loading state.",
  "frontend/src/components/LoginModal.tsx": "Modal dialog prompting unauthenticated users to sign in via Internet Identity, with a loading state and a dismiss option.",
  "frontend/src/components/PaymentEnquiryForm.tsx": "Form for submitting payment enquiries with fee type, amount, and duration fields; on success it displays a generated reference ID and a UPI QR code for payment.",
  "frontend/src/components/ProblemGenerator.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetup.tsx": "Onboarding form that collects a new user's name and saves their profile via a mutation hook to initialize their account.",
  "frontend/src/components/ProgressTracker.tsx": "Empty file with no content.",
  "frontend/src/components/QRCheckInView.tsx": "QR code check-in interface supporting both camera scanning and manual token entry, with token validation and confirmation steps for student session attendance.",
  "frontend/src/components/Services.tsx": "Displays a grid of math course cards with group and one-to-one pricing, and provides buttons to open a booking flow dialog or a payment enquiry form.",
  "frontend/src/components/StudentAttendanceView.tsx": "Shows a student's attendance records and summary (total, present, percentage with progress bar) for the last 90 days, fetched via query hooks.",
  "frontend/src/components/StudentDashboard.tsx": "Authenticated student dashboard displaying assigned sessions and learning materials in tabs, with a login prompt for unauthenticated users.",
  "frontend/src/components/StudentDetailView.tsx": "Admin-facing detail view for a specific student that allows adding/deleting sessions and materials, and managing meeting links per session.",
  "frontend/src/components/StudentEnquiryForm.tsx": "Form for students to submit a course enquiry; on success it displays and allows copying the generated enquiry ID.",
  "frontend/src/components/StudentEnquiryPortal.tsx": "Portal where students can look up their enquiry status by ID, displaying a status badge (pending, confirmed, or rejected) with relevant details.",
  "frontend/src/components/StudentMaterialsTab.tsx": "Displays a list of course materials (PDF, video, note, link) for a student with the ability to add new materials via a form and delete existing ones, using React Query mutations and toast notifications.",
  "frontend/src/components/StudentPortal.tsx": "Renders a student-facing portal that requires an access code to authenticate, then shows tabbed views for materials, schedule, support messages, and attendance using the verified booking data.",
  "frontend/src/components/StudentScheduleTab.tsx": "Manages a student's session schedule, allowing adding and deleting sessions and inline editing of meeting links (Google Meet, Zoom, Zoho) with platform-colored badges and confirmation dialogs.",
  "frontend/src/components/StudentSupportView.tsx": "Provides a messaging interface where students can send support messages to their instructor and view threaded replies with timestamps, using React Query for fetching and submitting messages.",
  "frontend/src/components/UpiPaymentStep.tsx": "Implements a UPI payment step with discount code validation, dynamic QR code generation, UPI deep-link for mobile, and a copy-to-clipboard UPI ID feature, calling onConfirm with the final discounted amount.",
  "frontend/src/components/VisitorTrackingView.tsx": "Admin UI component that displays visitor activity stats (total bookings, login events, course views) with a placeholder activity log, noting that a backend `getAllVisitorActivities` endpoint is needed for full functionality.",
  "frontend/src/config/razorpay.ts": "Empty file intended for Razorpay payment gateway configuration.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, initializing admin access control and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useBooking.ts": "Provides `useAddBookingRecord` and `useGetBookingRecords` hooks for creating and fetching booking records via the ICP actor, with React Query cache invalidation on mutations.",
  "frontend/src/hooks/useInstallPrompt.ts": "Hook that manages PWA install prompt state, exposing `canInstall`, `isInstalled`, and an `installApp` function that triggers the browser's native install dialog.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication via DFINITY's AuthClient, providing a React context and provider with login/logout state, identity persistence, and delegation validation.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks for all backend interactions including user profiles, admin checks, booking records (CRUD), and meeting/schedule management via the ICP actor.",
  "frontend/src/hooks/useRazorpay.ts": "Empty file intended for a Razorpay integration hook.",
  "frontend/src/index.css": "Global stylesheet defining the design system with Tailwind, custom CSS variables for navy/gold/cream color palette (light and dark modes), typography using Playfair Display and Inter fonts, and fixes for Radix UI overlay opacity.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/types/booking.ts": "TypeScript type definitions for booking-related data structures: form input (`BookingFormData`), stored records (`BookingRecord`), and UPI payment parameters (`UpiPaymentParams`).",
  "frontend/src/utils/pricingCalculator.ts": "Utility module defining per-class prices for one-on-one and group sessions, volume discount tiers, and functions to calculate final booking prices with discounts applied.",
  "frontend/src/utils/upiPayment.ts": "Provides utilities for generating UPI deep link URLs for payments to a fixed UPI ID, and a helper to detect mobile devices.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routes, with sessionStorage persistence and hash cleanup helpers.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with custom CSS-variable-based colors, serif/sans font families, border radii, box shadows, and enabling animate, typography, and container-queries plugins.",
  "project_state.json": "Tracks project state (version 3) for 'Rajat's Equation', listing existing features and pending feature requests around adding meeting platform/link support to admin and student portal sessions."
}