{
  "backend/main.mo": "Main actor for the mathematics tutoring platform defining all data types (bookings, attendance, discount codes, course materials, etc.) and including authorization, blob storage, and payment mixins.",
  "backend/migration.mo": "Migration module that upgrades the actor state by converting old DiscountCode records to ExtendedDiscountCode (adding isActive field) and initializing empty attendance and visitorActivities lists.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (attendance management, discount codes, booking flow) to their source files, components, and test IDs with confidence levels.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary document describing the purpose and key details of each frontend source file in the project.",
  "frontend/index.css": "Global CSS entry point defining OKLCH-based CSS custom properties for light and dark themes used by shadcn/ui components, with Tailwind directives.",
  "frontend/index.html": "HTML entry point for the Vite app with PWA meta tags, manifest link, navy theme color, and the React root div.",
  "frontend/public/manifest.json": "PWA manifest for 'Rajat's Equation - Mathematics Platform' specifying icons, theme colors, display mode, and app metadata.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and skipping ICP API calls, with install/activate lifecycle handlers for cache management.",
  "frontend/src/App.tsx": "Root React component that handles hash-based routing, authentication state via Internet Identity, profile setup gating, and login activity tracking. Renders Hero/Services/EnrollmentCTA, AdminDashboard, StudentPortal, or CompletedSessions based on the current route.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard with tabbed UI for managing bookings (mark paid, generate access codes, delete), student materials, schedules, support messages, attendance, discount codes, and visitor tracking. Uses booking records from custom query hooks and displays each booking in an expandable card.",
  "frontend/src/components/AdminSupportMessages.tsx": "Admin view for reading and replying to student support messages, grouped by student principal in collapsible threads. Shows pending reply counts and allows inline reply submission via a mutation hook.",
  "frontend/src/components/AttendanceManager.tsx": "Admin component for viewing and marking student attendance records, filtered by booking and date range. Fetches completed bookings, attendance records, and summary data, with a form to add new session attendance entries.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component that intercepts click events and shows a login modal if the user is not authenticated, otherwise passes the action through. Supports both inline and block-wrapper usage patterns.",
  "frontend/src/components/BookingConfirmation.tsx": "Displays a post-booking confirmation screen showing booking details (service, class type, number of classes, discount, amount) and an 'Awaiting Payment Verification' status badge. Purely presentational with an onClose callback.",
  "frontend/src/components/BookingFlowManager.tsx": "Manages a multi-step booking dialog flow (form → payment → confirmation), collecting booking data, processing UPI payment, and saving the booking record via a mutation hook.",
  "frontend/src/components/BookingForm.tsx": "Renders a booking form with fields for name, phone, date, time, service type, class type, and number of classes, with validation and dynamic pricing calculation before submission.",
  "frontend/src/components/ClassSessionsManager.tsx": "Admin UI component for managing class sessions per course, allowing adding and removing sessions with date, time, and Google Meet/Calendar links.",
  "frontend/src/components/CompletedSessions.tsx": "Displays a paginated grid of completed booking records fetched via a query hook, showing student name, service, date, and confirmation details.",
  "frontend/src/components/CourseMaterialsManager.tsx": "Admin UI component for managing course materials (PDFs, videos, notes, links) per course, supporting adding and removing materials with type-specific icons and color badges.",
  "frontend/src/components/CourseOffering.tsx": "Displays a featured course with pricing, ratings, and a UPI payment flow, allowing users to purchase the course and record the payment via a mutation hook.",
  "frontend/src/components/DiscountCodeManager.tsx": "Admin UI for generating and managing discount codes, supporting local code generation with a configurable percentage, copy-to-clipboard, and deactivation of existing codes.",
  "frontend/src/components/EnrollmentCTA.tsx": "Marketing section that highlights course benefits and provides call-to-action buttons for booking, WhatsApp contact, and YouTube, with an embedded booking flow dialog.",
  "frontend/src/components/Footer.tsx": "Site footer with brand info, quick navigation links, and contact details, including a Caffeine.ai attribution link.",
  "frontend/src/components/Hero.tsx": "Landing page hero section with branding, tagline, and action buttons for booking, course exploration, student portal, and admin dashboard based on authentication and admin status.",
  "frontend/src/components/LoginButton.tsx": "Authentication button that handles Internet Identity login and logout, showing loading state and clearing the React Query cache on logout.",
  "frontend/src/components/LoginModal.tsx": "A modal dialog component that prompts unauthenticated users to sign in via Internet Identity, with loading state handling and a 'Continue Browsing' cancel option.",
  "frontend/src/components/ProblemGenerator.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetup.tsx": "A full-page onboarding form that collects a new user's name and saves their profile via a mutation hook, welcoming them to the math tutoring platform.",
  "frontend/src/components/ProgressTracker.tsx": "Empty file with no content.",
  "frontend/src/components/Services.tsx": "Displays a grid of math tutoring courses with group and one-to-one pricing, offering WhatsApp booking links and an in-app booking flow manager.",
  "frontend/src/components/StudentAttendanceView.tsx": "Shows a student's attendance records and summary (attended/missed sessions, attendance rate) for a given course within a filterable date range.",
  "frontend/src/components/StudentMaterialsTab.tsx": "Renders a list of course materials (PDFs, videos, notes, links) for a student's course and allows adding or removing materials via form inputs.",
  "frontend/src/components/StudentPortal.tsx": "An access-code-gated student portal that, once authenticated, displays tabbed views for course materials, schedule, support, and attendance.",
  "frontend/src/components/StudentScheduleTab.tsx": "React component that displays and manages class sessions for a student, allowing admins to add or remove sessions with title, date, time, and meeting links.",
  "frontend/src/components/StudentSupportView.tsx": "React component that shows a student's support message thread and allows them to submit new messages to the instructor, with refresh capability.",
  "frontend/src/components/UpiPaymentStep.tsx": "React component for the UPI payment step in a booking flow, displaying a booking summary, handling discount code validation, and generating a UPI payment URL.",
  "frontend/src/components/VisitorTrackingView.tsx": "Admin view component that attempts to display visitor activity tracking data grouped by principal, currently limited by the absence of a backend getAllVisitorActivities endpoint.",
  "frontend/src/config/razorpay.ts": "Empty configuration file intended for Razorpay payment gateway settings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor, initializing admin access control and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useBooking.ts": "Custom hooks for adding and fetching booking records from the ICP backend, requiring authentication for reads.",
  "frontend/src/hooks/useInstallPrompt.ts": "Custom hook that manages the PWA install prompt lifecycle, exposing install availability, install action, and installed state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions and status flags. Includes an `InternetIdentityProvider` component that persists identity across page reloads.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend actor interactions including user profiles, admin checks, bookings, UPI payments, course details, and more. Each hook wraps actor calls with loading/enabled guards.",
  "frontend/src/hooks/useRazorpay.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, sets up Tailwind base/components/utilities, and defines CSS custom properties for the design system (navy, gold, cream tokens) with both light and dark mode variants.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with `QueryClientProvider` and `InternetIdentityProvider` into the root DOM element.",
  "frontend/src/types/booking.ts": "TypeScript interfaces for booking-related data structures: `BookingFormData`, `BookingRecord`, and `UpiPaymentParams`.",
  "frontend/src/utils/pricingCalculator.ts": "Utility functions and constants for calculating class booking prices, including per-service/class-type pricing, volume discount tiers (10–35% off), and a `calculateBookingPrice` function returning a full pricing breakdown.",
  "frontend/src/utils/upiPayment.ts": "Utility for UPI payments that defines the payee UPI ID and exports `generateUpiUrl` to build a UPI deep link URL and `isMobileDevice` to detect mobile browsers.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom CSS-variable-based colors (navy, gold, cream), serif/sans font families, card shadows, and accordion animations, plus the `tailwindcss-animate` and `@tailwindcss/typography` plugins.",
  "project_state.json": "Project state file versioning existing features and new requests for an education platform with admin/student roles, covering attendance tracking, discount codes, and unpurchased visitor tracking."
}