{
  "backend/main.mo": "Main Motoko actor for the backend defining all data types (MathProblem, Booking, UserProfile, etc.) and including mixins for storage, authorization, Stripe, and HTTP outcalls for a mathematics tutoring platform.",
  "feature_evidence.json": "Feature evidence report mapping a single feature (logout button dark color styling in Header and LoginButton) to its relevant files, components, and test IDs with high confidence.",
  "frontend-file-summaries.txt": "Auto-generated JSON document containing one-sentence summaries of all frontend source files, describing their roles in routing, hooks, components, and PWA setup.",
  "frontend/index.css": "Root CSS file importing Tailwind directives and defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the Vite app with PWA meta tags, navy theme color, manifest link, and the title 'Rajat's Equation - Master Mathematical Thinking'.",
  "frontend/public/manifest.json": "PWA manifest for 'Rajat's Equation - Mathematics Platform' specifying icons, theme colors, display mode, and app metadata for installability.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and skipping IC API calls, with install, activate, and fetch event handlers for offline PWA support.",
  "frontend/src/App.tsx": "Root React component implementing hash-based routing across home, admin, student-portal, and completed-sessions pages, with post-login admin redirect logic, profile setup gating, and route guards.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component with tabbed interface for managing bookings, attendance, support messages, discount codes, course materials, class sessions, and visitor tracking. Includes a BookingCard sub-component for displaying and acting on individual booking records.",
  "frontend/src/components/AdminSupportMessages.tsx": "Admin view for reading and replying to student support messages, grouped by student principal with expandable threads and pending reply badges.",
  "frontend/src/components/AttendanceManager.tsx": "Admin component for searching and recording student attendance by booking, supporting date-range queries and manual session marking with present/absent toggle.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component that intercepts clicks on child elements and shows a login modal if the user is not authenticated via Internet Identity, otherwise passes the action through.",
  "frontend/src/components/BookingConfirmation.tsx": "Read-only confirmation screen displayed after a booking is submitted, showing booking details, payment status, discount info, and a UPI reference ID.",
  "frontend/src/components/BookingFlowManager.tsx": "Multi-step dialog manager that orchestrates the booking flow through form, UPI payment, and confirmation steps, saving the booking record to the backend on payment confirmation.",
  "frontend/src/components/BookingForm.tsx": "A React form component for booking tutoring sessions that collects student name, phone, date, time, service type, class type, and number of classes, with validation and dynamic pricing/discount calculation.",
  "frontend/src/components/ClassSessionsManager.tsx": "An admin component for managing class sessions per course, allowing adding and removing scheduled sessions with date, time, Google Meet, and Google Calendar links.",
  "frontend/src/components/CompletedSessions.tsx": "A read-only view component that displays a grid of completed booking records fetched from the backend, showing student name, service, date, and confirmation details.",
  "frontend/src/components/CourseMaterialsManager.tsx": "An admin component for managing course materials (PDFs, videos, notes, links) per course, supporting adding and removing materials with type-specific icons and color badges.",
  "frontend/src/components/CourseOffering.tsx": "A public-facing section component that displays a featured course with pricing and initiates a UPI payment flow, recording the payment and updating the user's purchase status on confirmation.",
  "frontend/src/components/DiscountCodeManager.tsx": "Admin panel component for managing discount codes, displaying hardcoded built-in codes in a table, and allowing local generation of new discount codes with copy and deactivate functionality.",
  "frontend/src/components/EnrollmentCTA.tsx": "Marketing section component that displays enrollment benefits, a call-to-action with WhatsApp/YouTube links, and a booking flow modal trigger for Rajat's Equation math tutoring service.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand info, quick navigation links, contact details, and a Caffeine.ai attribution badge.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, desktop/mobile nav links, Internet Identity login/logout, and conditional admin link visibility based on authentication state.",
  "frontend/src/components/Hero.tsx": "Landing page hero section with a background image, headline, and action buttons for booking, course exploration, student portal, and admin dashboard based on authentication and admin status.",
  "frontend/src/components/LoginButton.tsx": "Reusable button component that handles Internet Identity login and logout, showing appropriate icons and loading state during authentication.",
  "frontend/src/components/LoginModal.tsx": "A modal dialog component that prompts unauthenticated users to sign in via Internet Identity, with loading state handling and a 'Continue Browsing' cancel option.",
  "frontend/src/components/ProblemGenerator.tsx": "Empty file with no content or exports.",
  "frontend/src/components/ProfileSetup.tsx": "A full-screen onboarding form that collects a new user's name and saves their profile via a mutation hook, displaying a welcome toast on success.",
  "frontend/src/components/ProgressTracker.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Services.tsx": "Displays a grid of math tutoring courses with group and one-to-one pricing, and provides booking flow and WhatsApp contact options for each course.",
  "frontend/src/components/StudentAttendanceView.tsx": "Shows a student's attendance records and summary (attended/missed sessions, attendance rate) for a given course within a filterable date range.",
  "frontend/src/components/StudentMaterialsTab.tsx": "Renders a list of course materials (PDFs, videos, notes, links) for a student's course and allows adding or removing materials via form inputs.",
  "frontend/src/components/StudentPortal.tsx": "An access-code-gated student portal that, once verified, displays tabbed views for course materials, schedule, support, and attendance for the authenticated student.",
  "frontend/src/components/StudentScheduleTab.tsx": "React component that displays and manages scheduled class sessions for a student, allowing admins to add or remove sessions with title, date, time, and meeting links.",
  "frontend/src/components/StudentSupportView.tsx": "React component that shows a student's support message thread with their instructor and allows submitting new messages, with refresh functionality.",
  "frontend/src/components/UpiPaymentStep.tsx": "React component for the UPI payment step in a booking flow, supporting discount code validation, QR code generation, UPI deep-link for mobile, and UPI ID copy functionality.",
  "frontend/src/components/VisitorTrackingView.tsx": "Admin view component that displays visitor activity stats (tracked visitors, login events, course views) as placeholder cards, noting that a backend endpoint is needed for real data.",
  "frontend/src/config/razorpay.ts": "Empty configuration file, likely intended for Razorpay payment gateway settings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useBooking.ts": "Custom hooks for adding and fetching booking records from the ICP backend, using React Query mutations and queries with actor-based authentication.",
  "frontend/src/hooks/useInstallPrompt.ts": "Custom hook that manages the PWA install prompt lifecycle, exposing install availability, install trigger function, and installed state.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication on the ICP platform, managing login/logout state, identity persistence, and AuthClient creation with configurable options.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend actor interactions including admin checks, user profiles, booking records, course materials, attendance, and discount codes.",
  "frontend/src/hooks/useRazorpay.ts": "Empty file, likely a placeholder for a Razorpay payment integration hook.",
  "frontend/src/index.css": "Global stylesheet importing Tailwind and Google Fonts, defining CSS custom properties for light/dark themes (navy, gold, cream palette) and utility overrides for dialogs, dropdowns, and popovers.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/booking.ts": "TypeScript interfaces for booking form data, booking records, and UPI payment parameters used across the booking flow.",
  "frontend/src/utils/pricingCalculator.ts": "Utility functions and constants for calculating per-class prices by service/class type and applying tiered discounts (10–35%) based on number of classes booked.",
  "frontend/src/utils/upiPayment.ts": "Utility for generating UPI deep link URLs for payments to a fixed UPI ID, with a helper to detect mobile devices.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (navy, gold, cream), fonts (Playfair Display, Inter), border radii, box shadows, and accordion animations.",
  "project_state.json": "Project state metadata describing the current fix request: making the logout button clearly visible with dark color styling in the Header and LoginButton components across desktop and mobile layouts."
}