{
  "backend/main.mo": "Main Motoko actor defining all data types (MathProblem, Booking, Discount codes, Attendance, etc.) and including mixins for storage and authorization for a mathematics tutoring platform on ICP.",
  "feature_evidence.json": "Feature evidence report mapping two discount-code features (RAJAT50/MATHS30) to their implementation files: UpiPaymentStep.tsx for validation logic and DiscountCodeManager.tsx for admin UI display.",
  "frontend-file-summaries.txt": "Auto-generated JSON summaries of all frontend source files, describing the purpose and key details of each component, hook, and configuration file in the React frontend.",
  "frontend/index.css": "Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark themes including background, foreground, primary, sidebar, and chart color tokens.",
  "frontend/index.html": "HTML entry point for the PWA titled 'Rajat's Equation - Master Mathematical Thinking', with PWA meta tags, manifest link, and navy theme color.",
  "frontend/public/manifest.json": "PWA manifest for 'Rajat's Equation - Mathematics Platform' specifying app name, icons, theme colors, and standalone display mode.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and skipping ICP API calls, with install, activate, and fetch event handlers for offline PWA support.",
  "frontend/src/App.tsx": "Root React component with hash-based routing for home, admin, portal, and completed-sessions routes; tracks login activity once per session and conditionally renders ProfileSetup and Footer.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component that displays booking records in tabs, allowing admins to mark bookings as paid, generate access codes, delete bookings, and manage student materials, schedules, support messages, attendance, discount codes, and visitor tracking.",
  "frontend/src/components/AdminSupportMessages.tsx": "Admin component for viewing and replying to student support messages, grouped by student principal ID with expandable message threads and pending reply indicators.",
  "frontend/src/components/AttendanceManager.tsx": "Admin component for tracking and managing student attendance, allowing admins to search attendance records by booking and date range, mark new sessions as present or absent, and toggle existing attendance records.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component that intercepts click events and shows a login modal if the user is not authenticated via Internet Identity, otherwise passing the action through normally.",
  "frontend/src/components/BookingConfirmation.tsx": "Displays a booking confirmation screen showing booking details (service, class type, number of classes, discount, final amount) with an 'Awaiting Payment Verification' status after a user submits a booking.",
  "frontend/src/components/BookingFlowManager.tsx": "Multi-step booking flow dialog that manages transitions between the booking form, UPI payment step, and confirmation screen, saving the booking record to the backend on payment confirmation.",
  "frontend/src/components/BookingForm.tsx": "A React form component for booking tutoring sessions that collects student name, phone, date, time, service type, class type, and number of classes, with validation and dynamic pricing/discount calculation.",
  "frontend/src/components/ClassSessionsManager.tsx": "An admin component for managing class sessions per course, allowing adding and removing scheduled sessions with date, time, Google Meet, and Google Calendar links.",
  "frontend/src/components/CompletedSessions.tsx": "A read-only view component that displays a grid of completed booking records fetched via a query hook, showing student name, service, date, and confirmation details.",
  "frontend/src/components/CourseMaterialsManager.tsx": "An admin component for managing course materials (PDFs, videos, notes, links) per course, supporting adding and removing materials with type-specific icons and color badges.",
  "frontend/src/components/CourseOffering.tsx": "A section component that displays a featured course with pricing and initiates a UPI payment flow, tracking purchase state via a backend mutation and user profile query.",
  "frontend/src/components/DiscountCodeManager.tsx": "Admin UI component for managing discount codes, displaying hardcoded built-in codes in a table, generating new codes locally with a given percentage, and deactivating existing codes via a mutation hook.",
  "frontend/src/components/EnrollmentCTA.tsx": "Landing page section component that showcases enrollment benefits in a card grid and provides CTA buttons for booking, WhatsApp contact, and YouTube channel links.",
  "frontend/src/components/Footer.tsx": "Site footer component rendering brand info, quick navigation links, and contact details with a Caffeine.ai attribution link.",
  "frontend/src/components/Hero.tsx": "Hero section component displaying the site headline, logo, and action buttons (book, explore courses, student portal, admin dashboard) based on authentication and admin status.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, showing loading state and clearing the React Query cache on logout.",
  "frontend/src/components/LoginModal.tsx": "Modal dialog prompting unauthenticated users to sign in via Internet Identity, with a login button and a dismiss option.",
  "frontend/src/components/ProblemGenerator.tsx": "Empty file with no content or exports.",
  "frontend/src/components/ProfileSetup.tsx": "Onboarding form component that collects a new user's name and saves their profile via a mutation hook to initialize their account.",
  "frontend/src/components/ProgressTracker.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Services.tsx": "Displays a grid of math course cards with group and one-to-one pricing, and provides buttons to open a booking flow or WhatsApp chat for each course.",
  "frontend/src/components/StudentAttendanceView.tsx": "Shows a student's attendance records and summary (with a progress bar) for a given course and date range, fetched via query hooks.",
  "frontend/src/components/StudentMaterialsTab.tsx": "Lists course materials (PDFs, videos, notes, links) for a student's course and allows adding or removing materials via backend mutation hooks.",
  "frontend/src/components/StudentPortal.tsx": "Access-code-gated student portal that, after verification, renders tabbed views for materials, schedule, support, and attendance using the student's booking record.",
  "frontend/src/components/StudentScheduleTab.tsx": "Displays upcoming and past class sessions for a course (sorted by date/time) and allows adding or removing sessions with optional Google Meet and Calendar links.",
  "frontend/src/components/StudentSupportView.tsx": "React component that displays a student's support message thread with their instructor, allowing them to submit new messages and view admin replies with timestamps.",
  "frontend/src/components/UpiPaymentStep.tsx": "React component for a UPI payment step that shows a booking summary, handles discount code validation, generates a QR code and UPI deep link, and confirms payment with the final amount.",
  "frontend/src/components/VisitorTrackingView.tsx": "Admin view component that attempts to display visitor activity grouped by principal, currently limited by the lack of a backend getAllVisitorActivities endpoint and returns empty results.",
  "frontend/src/config/razorpay.ts": "Empty configuration file for Razorpay integration with no content.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing admin access control and invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useBooking.ts": "Custom hooks for adding and fetching booking records from the ICP backend, using React Query mutations and queries with actor-based authentication.",
  "frontend/src/hooks/useInstallPrompt.ts": "Custom hook that captures the browser's PWA install prompt event and exposes install state and a trigger function for prompting the user to install the app.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor calls including user profiles, admin checks, bookings, UPI payments, course details, attendance, discount codes, and visitor analytics.",
  "frontend/src/hooks/useRazorpay.ts": "Empty file, likely a placeholder for a Razorpay payment integration hook.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, and defines CSS custom properties for light/dark themes including navy, gold, and cream color tokens.",
  "frontend/src/main.tsx": "React app entry point that wraps the app with QueryClientProvider and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/types/booking.ts": "TypeScript interfaces for booking form data, booking records, and UPI payment parameters used across the booking flow.",
  "frontend/src/utils/pricingCalculator.ts": "Utility functions and constants for calculating per-class prices by service/class type and applying tiered discounts (10–35%) based on number of classes booked.",
  "frontend/src/utils/upiPayment.ts": "Utility for generating UPI deep link URLs with a fixed UPI ID and detecting mobile devices for payment redirection.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (navy, gold, cream), fonts (Playfair Display, Inter), shadows, border radii, and accordion animations.",
  "project_state.json": "Project state metadata tracking existing features and pending requests, specifically the addition of discount codes RAJAT50 (50%) and MATHS30 (30%) alongside existing SAVE10 and SUMMER20 codes."
}