{
  "backend/main.mo": "Main Motoko actor for the platform defining all core types (MathProblem, Booking, UserProfile, etc.) and including mixins for storage and authorization; implements the full backend API for bookings, payments, course materials, attendance, and student support.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—Internet Identity login/logout in the nav bar and admin dashboard access control—to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "Auto-generated JSON document providing one- to two-sentence summaries of each frontend source file, serving as a reference index for the frontend codebase.",
  "frontend/index.css": "Global Tailwind CSS entry point defining OKLCH-based CSS custom properties for light and dark themes, including colors for background, foreground, primary, accent, sidebar, and chart tokens.",
  "frontend/index.html": "HTML shell for the Vite/React app with PWA meta tags, navy theme color, manifest link, and the title 'Rajat's Equation - Master Mathematical Thinking'.",
  "frontend/public/manifest.json": "PWA web app manifest for 'Rajat's Equation - Mathematics Platform' specifying icons, theme/background colors, display mode, and app categories.",
  "frontend/public/service-worker.js": "Service worker that caches static assets on install, cleans old caches on activate, and uses a cache-first strategy for static files while bypassing caching for ICP API calls.",
  "frontend/src/App.tsx": "Root React component implementing hash-based routing across home, admin, student-portal, and completed-sessions pages; handles post-login admin redirect, admin route guarding, profile setup gating, and React Query cache clearing on logout.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component with tabbed interface for managing bookings, attendance, support messages, discount codes, course materials, class sessions, and visitor tracking. Includes a BookingCard sub-component with actions to mark paid, confirm payment, and delete bookings.",
  "frontend/src/components/AdminSupportMessages.tsx": "Admin view for reading and replying to student support messages, grouped by student principal with expandable threads and pending reply counts.",
  "frontend/src/components/AttendanceManager.tsx": "Admin component for viewing and marking student attendance records, allowing selection of a booking, date range filtering, and adding new session attendance entries.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component that intercepts click events and shows a login modal if the user is not authenticated via Internet Identity, otherwise passes through the action.",
  "frontend/src/components/BookingConfirmation.tsx": "Displays a booking confirmation screen showing booking details and an 'Awaiting Payment Verification' status after a user submits a booking with UPI payment.",
  "frontend/src/components/BookingFlowManager.tsx": "Multi-step booking flow dialog managing transitions between the booking form, UPI payment step, and confirmation screen, and persisting the booking record on the backend.",
  "frontend/src/components/BookingForm.tsx": "A React form component for booking tutoring sessions that collects student name, phone, date, time, service type, class type, and number of classes, with validation and dynamic pricing/discount calculation.",
  "frontend/src/components/ClassSessionsManager.tsx": "An admin component for managing class sessions per course, allowing adding and removing scheduled sessions with date, time, Google Meet, and Google Calendar links.",
  "frontend/src/components/CompletedSessions.tsx": "A read-only view component that displays a grid of completed booking records fetched from the backend, showing student name, service, date, and confirmation details.",
  "frontend/src/components/CourseMaterialsManager.tsx": "An admin component for managing course materials (PDFs, videos, notes, links) per course, supporting adding and removing materials with type-specific icons and color badges.",
  "frontend/src/components/CourseOffering.tsx": "A public-facing section component that displays a featured course with pricing and initiates a UPI payment flow, tracking purchase state via the user profile and a payment mutation.",
  "frontend/src/components/DiscountCodeManager.tsx": "Admin panel component for managing discount codes, displaying hardcoded built-in codes in a table, and allowing local generation of new discount codes with copy and deactivate functionality.",
  "frontend/src/components/EnrollmentCTA.tsx": "Marketing section component that displays enrollment benefits, a call-to-action with WhatsApp/YouTube links, and a booking flow modal trigger for Rajat's Equation math tutoring service.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand info, quick navigation links, contact details, and a Caffeine.ai attribution badge.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, desktop/mobile nav links, Internet Identity login/logout, and conditional admin link visibility based on authentication state.",
  "frontend/src/components/Hero.tsx": "Landing page hero section with a background image, tagline, and action buttons for booking, course exploration, student portal, and admin dashboard based on authentication and admin status.",
  "frontend/src/components/LoginButton.tsx": "Reusable button component that handles Internet Identity login and logout, showing appropriate icons and loading state during authentication.",
  "frontend/src/components/LoginModal.tsx": "A modal dialog component that prompts unauthenticated users to sign in via Internet Identity, with loading state handling and a 'Continue Browsing' cancel option.",
  "frontend/src/components/ProblemGenerator.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetup.tsx": "A full-page onboarding form that collects a new user's name and saves their profile via a mutation hook, welcoming them to the math tutoring platform.",
  "frontend/src/components/ProgressTracker.tsx": "Empty file with no content.",
  "frontend/src/components/Services.tsx": "Displays a grid of math tutoring courses with group and one-to-one pricing, offering WhatsApp booking links and an in-app booking flow via BookingFlowManager.",
  "frontend/src/components/StudentAttendanceView.tsx": "Shows a student's attendance records and summary (total, attended, missed sessions with a progress bar) for a given course, filterable by date range.",
  "frontend/src/components/StudentMaterialsTab.tsx": "Displays and manages course materials (PDFs, videos, notes, links) for a student's course, supporting add and remove operations with type-colored badges.",
  "frontend/src/components/StudentPortal.tsx": "An access-code-gated student portal that, once authenticated, renders tabbed views for course materials, schedule, support, and attendance using the student's booking record.",
  "frontend/src/components/StudentScheduleTab.tsx": "React component that displays and manages scheduled class sessions for a student, allowing admins to add or remove sessions with date, time, and Google Meet/Calendar links.",
  "frontend/src/components/StudentSupportView.tsx": "React component that shows a student's support message thread with their instructor and allows submitting new messages, with a refresh button to reload replies.",
  "frontend/src/components/UpiPaymentStep.tsx": "React component for the UPI payment step in a booking flow, supporting discount code validation, QR code display, UPI deep-link for mobile, and UPI ID copy functionality.",
  "frontend/src/components/VisitorTrackingView.tsx": "Admin view component that displays placeholder visitor activity stats (tracked visitors, login events, course views) and notes that a backend endpoint is needed to populate real data.",
  "frontend/src/config/razorpay.ts": "Empty configuration file, likely intended for Razorpay payment gateway settings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useBooking.ts": "Custom hooks for adding and fetching booking records from the ICP backend, using React Query mutations and queries with actor-based authentication.",
  "frontend/src/hooks/useInstallPrompt.ts": "Custom hook that captures the browser's PWA install prompt event and exposes install state and an installApp function to trigger the native install dialog.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout functions, identity state, and login status.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (queries and mutations) for all backend actor calls including admin checks, user profiles, booking records, course materials, attendance, and discount codes.",
  "frontend/src/hooks/useRazorpay.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, sets up Tailwind CSS, and defines CSS custom properties for light/dark theme color tokens including navy, gold, and cream palette variables.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/booking.ts": "TypeScript interfaces for booking form data, booking records, and UPI payment parameters used across the booking flow.",
  "frontend/src/utils/pricingCalculator.ts": "Utility functions and constants for calculating class booking prices, per-class rates by service/class type, and tiered discount percentages based on number of classes.",
  "frontend/src/utils/upiPayment.ts": "Utility for generating UPI deep link URLs for payments to a fixed UPI ID, and a helper to detect mobile devices.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, storing, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage persistence support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (navy, gold, cream), fonts (Playfair Display, Inter), border radii, box shadows, and accordion animations.",
  "project_state.json": "Tracks project state including existing features, known issues, and pending feature requests for an app with Internet Identity authentication and an admin dashboard restricted to rkj.jain2204@gmail.com. Records architectural notes and fix requests across versioned iterations."
}