{
  "backend/main.mo": "Main Motoko actor for the backend, defining all data types (MathProblem, Booking, UserProfile, etc.) and including mixins for storage, authorization, Stripe, and HTTP outcalls for a mathematics tutoring platform.",
  "feature_evidence.json": "Feature evidence report documenting that the logout button styling in Header.tsx and LoginButton.tsx was reverted to Version 34 appearance, undoing the dark color change from Version 35.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key implementation details of each component, hook, and configuration file in the React frontend.",
  "frontend/index.css": "Root CSS file that imports Tailwind directives and defines OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the application.",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to 'Rajat's Equation - Master Mathematical Thinking' and including PWA meta tags, manifest link, and app icon.",
  "frontend/public/manifest.json": "PWA manifest for 'Rajat's Equation - Mathematics Platform' specifying app name, icons, theme colors, display mode, and categories for installability.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and network-first for API calls, with install, activate, and fetch event handlers to enable offline PWA functionality.",
  "frontend/src/App.tsx": "Root React component implementing hash-based routing across home, admin, student-portal, and completed-sessions pages, with post-login redirect logic (admin → #admin), profile setup gating, and admin route guards.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component with tabbed interface for managing bookings, attendance, support messages, discount codes, course materials, class sessions, and visitor tracking. Includes a BookingCard sub-component with actions to mark paid, confirm payment, and delete bookings.",
  "frontend/src/components/AdminSupportMessages.tsx": "Admin view for reading and replying to student support messages, grouped by student principal with expandable threads showing pending reply counts and timestamps.",
  "frontend/src/components/AttendanceManager.tsx": "Admin component for viewing and marking student attendance records, allowing selection of a booking, date range filtering, and manual session entry with present/absent toggle.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component that intercepts click events and shows a login modal if the user is not authenticated via Internet Identity, otherwise passes the action through normally.",
  "frontend/src/components/BookingConfirmation.tsx": "Displays a post-booking confirmation screen showing booking details (service, class type, date, payment ID, discount) with an awaiting-payment-verification status badge.",
  "frontend/src/components/BookingFlowManager.tsx": "Multi-step booking dialog manager that sequences users through a form step, UPI payment step, and confirmation step, saving the booking record to the backend on payment confirmation.",
  "frontend/src/components/BookingForm.tsx": "A React form component for booking tutoring sessions that collects student name, phone, date, time, service type, class type, and number of classes, with validation and dynamic pricing/discount calculation.",
  "frontend/src/components/ClassSessionsManager.tsx": "An admin component for managing class sessions per course, allowing adding and removing scheduled sessions with date, time, Google Meet, and calendar links.",
  "frontend/src/components/CompletedSessions.tsx": "A read-only view component that displays a list of completed booking records fetched from the backend, showing student name, service, date, and confirmation details.",
  "frontend/src/components/CourseMaterialsManager.tsx": "An admin component for managing course materials (PDFs, videos, notes, links) per course, supporting adding and removing materials with type-specific icons and color badges.",
  "frontend/src/components/CourseOffering.tsx": "A public-facing section component that displays a featured course with pricing and handles UPI payment flow, recording the payment and updating the user's purchase status.",
  "frontend/src/components/DiscountCodeManager.tsx": "Admin panel component for managing discount codes, displaying hardcoded built-in codes in a table, and locally generating new discount codes with copy and deactivate functionality.",
  "frontend/src/components/EnrollmentCTA.tsx": "Marketing section component that displays program benefits, a call-to-action for enrollment, and buttons to open the booking flow, WhatsApp, or YouTube channel.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand info, quick navigation links, contact details, and a Caffeine.ai attribution badge.",
  "frontend/src/components/Header.tsx": "Sticky navigation header with logo, desktop and mobile nav links, admin-only dashboard link, and Internet Identity login/logout controls.",
  "frontend/src/components/Hero.tsx": "Landing page hero section with branding, tagline, and action buttons for booking, course exploration, student portal, and admin dashboard (conditionally shown based on auth/admin state).",
  "frontend/src/components/LoginButton.tsx": "Reusable button component that handles Internet Identity login and logout, showing a loading spinner during authentication.",
  "frontend/src/components/LoginModal.tsx": "A modal dialog component that prompts unauthenticated users to sign in via Internet Identity, with loading state handling and a 'Continue Browsing' cancel option.",
  "frontend/src/components/ProblemGenerator.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetup.tsx": "A full-screen onboarding form that collects a new user's name and saves their profile via a mutation hook, welcoming them to the math tutoring platform.",
  "frontend/src/components/ProgressTracker.tsx": "Empty file with no content.",
  "frontend/src/components/Services.tsx": "Displays a grid of math tutoring courses with group and one-to-one pricing, offering WhatsApp booking links and an in-app booking flow via BookingFlowManager.",
  "frontend/src/components/StudentAttendanceView.tsx": "Shows a student's attendance records and summary (with attendance rate) for a given course within a filterable date range, using skeleton loaders while data fetches.",
  "frontend/src/components/StudentMaterialsTab.tsx": "Renders course materials (PDFs, videos, notes, links) for a student with the ability to add or remove materials via form inputs and mutation hooks.",
  "frontend/src/components/StudentPortal.tsx": "An access-code-gated student portal that, once verified, displays tabbed views for course materials, schedule, support, and attendance using the student's booking record.",
  "frontend/src/components/StudentScheduleTab.tsx": "React component that displays and manages class sessions for a student's course, supporting adding new sessions with title/date/time/links and removing existing ones, sorted chronologically.",
  "frontend/src/components/StudentSupportView.tsx": "React component that shows a student's support message thread with their instructor and allows submitting new messages, with refresh functionality and timestamp formatting.",
  "frontend/src/components/UpiPaymentStep.tsx": "React component for UPI payment flow that shows a booking summary, handles discount code validation, generates a QR code and UPI deep link, and confirms payment with final amount.",
  "frontend/src/components/VisitorTrackingView.tsx": "Admin view component that displays placeholder visitor activity stats (tracked visitors, login events, course views) and an activity log, noting that a backend endpoint is needed for real data.",
  "frontend/src/config/razorpay.ts": "Empty configuration file intended for Razorpay payment gateway settings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing access control with an admin token and invalidating dependent queries when the actor changes.",
  "frontend/src/hooks/useBooking.ts": "Custom hooks for adding and fetching booking records from the ICP backend actor, using React Query mutations and queries with identity-based access control.",
  "frontend/src/hooks/useInstallPrompt.ts": "Custom hook that manages PWA install prompt state, detecting if the app is already installed and exposing an installApp function that triggers the browser's native install dialog.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and hook for Internet Identity authentication using DFINITY's AuthClient, exposing login/logout state, identity, and status flags.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks (useQuery/useMutation) for all backend actor calls including admin checks, user profiles, bookings, attendance, course materials, and discount codes.",
  "frontend/src/hooks/useRazorpay.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global stylesheet importing Tailwind and Google Fonts, defining CSS custom properties for light/dark themes (navy, gold, cream palette) and overrides for opaque dialogs and dropdowns.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/booking.ts": "TypeScript interfaces for booking form data, booking records, and UPI payment parameters.",
  "frontend/src/utils/pricingCalculator.ts": "Utility functions and constants for calculating per-class prices, bulk discount tiers, and final booking amounts based on service type and class count.",
  "frontend/src/utils/upiPayment.ts": "Utility for generating UPI deep-link payment URLs and detecting mobile devices.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routes, with sessionStorage fallback.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (navy, gold, cream), fonts (Playfair Display, Inter), shadows, border radii, and accordion animations.",
  "project_state.json": "Project state metadata file tracking the current feature request: reverting logout button styling in Header and LoginButton components back to Version 34."
}