{
  "backend/main.mo": "Main Motoko actor for the backend, defining all data types (MathProblem, Booking, UserProfile, etc.) and including mixins for storage, authorization, Stripe, and HTTP outcalls for a mathematics tutoring platform.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features—discount code input in the booking form and fully opaque dropdown menus—to their relevant source files and component dependencies.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short summaries of each frontend source file, describing the purpose and key details of components, hooks, and configuration files.",
  "frontend/index.css": "Root CSS file setting up Tailwind directives and defining OKLCH-based CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "HTML entry point for the Vite app, setting the page title, PWA meta tags, manifest link, and mounting the React root div.",
  "frontend/public/manifest.json": "PWA manifest for 'Rajat's Equation - Mathematics Platform' defining app name, icons, theme colors, and display settings for installable web app support.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and network-first for API calls, with install, activate, and fetch event handlers for PWA offline support.",
  "frontend/src/App.tsx": "Root React component handling hash-based routing across home, admin, portal, and completed-sessions routes, with login tracking, profile setup gating, and conditional footer rendering.",
  "frontend/src/components/AdminDashboard.tsx": "Admin dashboard component that displays booking records in a tabbed interface, allowing admins to mark bookings as paid, generate access codes, delete bookings, and navigate to sub-tabs for materials, schedules, support messages, attendance, discount codes, and visitor tracking.",
  "frontend/src/components/AdminSupportMessages.tsx": "Admin component for viewing and replying to student support messages, grouped by student principal ID with expandable threads showing pending reply counts and inline reply forms.",
  "frontend/src/components/AttendanceManager.tsx": "Admin attendance management component that lets admins search attendance records by student and date range, mark new attendance sessions as present or absent, and toggle existing attendance records for completed bookings.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component that intercepts click events to enforce authentication, showing a login modal for unauthenticated users and passing through or invoking an action callback for authenticated users.",
  "frontend/src/components/BookingConfirmation.tsx": "Confirmation screen displayed after a booking is submitted, showing booking details (service, class type, number of classes, discount, final amount) and an 'awaiting payment verification' status badge.",
  "frontend/src/components/BookingFlowManager.tsx": "Multi-step booking dialog manager that sequences users through a booking form, UPI payment step, and confirmation screen, saving the booking record to the backend upon payment confirmation.",
  "frontend/src/components/BookingForm.tsx": "A React form component for booking tutoring sessions that collects student name, phone, date, time, service type, class type, and number of classes, with validation and dynamic pricing/discount calculation.",
  "frontend/src/components/ClassSessionsManager.tsx": "An admin component for managing class sessions per course, allowing adding and removing scheduled sessions with date, time, Google Meet, and calendar links.",
  "frontend/src/components/CompletedSessions.tsx": "A read-only view component that displays a grid of completed booking records fetched via a query hook, showing student name, service, date, and confirmation details.",
  "frontend/src/components/CourseMaterialsManager.tsx": "An admin component for managing course materials (PDFs, videos, notes, links) per course, supporting adding and removing materials with type-specific icons and color badges.",
  "frontend/src/components/CourseOffering.tsx": "A section component that displays a featured course with pricing and initiates a UPI payment flow, recording the payment and updating the user's purchase status upon confirmation.",
  "frontend/src/components/DiscountCodeManager.tsx": "Admin UI component for managing discount codes, allowing generation of locally-created codes with a percentage value and deactivation of existing active codes fetched from the backend.",
  "frontend/src/components/EnrollmentCTA.tsx": "Landing page section component that displays enrollment benefits, a call-to-action with booking flow, and links to WhatsApp and YouTube for Rajat's Equation math tutoring service.",
  "frontend/src/components/Footer.tsx": "Site footer component with brand info, quick navigation links, contact details, and a Caffeine.ai attribution badge.",
  "frontend/src/components/Hero.tsx": "Hero section component for the homepage that displays branding, a tagline, and action buttons for booking, course exploration, student portal, and admin dashboard based on auth/admin state.",
  "frontend/src/components/LoginButton.tsx": "Button component that handles Internet Identity login and logout, clearing the React Query cache on logout and showing a loading spinner during authentication.",
  "frontend/src/components/LoginModal.tsx": "Modal dialog prompting unauthenticated users to sign in via Internet Identity, with a login button and a dismiss option.",
  "frontend/src/components/ProblemGenerator.tsx": "Empty file with no content or exports.",
  "frontend/src/components/ProfileSetup.tsx": "Onboarding form component that collects a new user's name and saves their profile via a mutation hook to initialize their account.",
  "frontend/src/components/ProgressTracker.tsx": "Empty file with no content or exports.",
  "frontend/src/components/Services.tsx": "Displays a grid of math course cards with group and one-to-one pricing, and provides booking flow and WhatsApp demo-request links for each course.",
  "frontend/src/components/StudentAttendanceView.tsx": "Shows a student's attendance records and summary (with a progress bar and stats) for a given course, filtered by a configurable date range.",
  "frontend/src/components/StudentMaterialsTab.tsx": "Lists course materials (PDFs, videos, notes, links) for a student's course and allows adding or removing materials via a form.",
  "frontend/src/components/StudentPortal.tsx": "Access-code-gated student portal that, after verification, renders tabbed views for course materials, schedule, support, and attendance.",
  "frontend/src/components/StudentScheduleTab.tsx": "Displays scheduled class sessions for a course sorted by date/time and allows adding or removing sessions with optional Google Meet and Calendar links.",
  "frontend/src/components/StudentSupportView.tsx": "React component that displays a student's support message thread with their instructor, allowing them to submit new messages and view replies with timestamps.",
  "frontend/src/components/UpiPaymentStep.tsx": "React component for the UPI payment step in a booking flow, handling discount code validation, displaying a booking summary, and generating a UPI deep-link URL for payment.",
  "frontend/src/components/VisitorTrackingView.tsx": "Admin view component that attempts to display visitor activity tracking grouped by principal, currently limited by the lack of a backend getAllVisitorActivities endpoint.",
  "frontend/src/config/razorpay.ts": "Empty configuration file intended for Razorpay payment gateway settings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, initializing admin access control when a secret token is present.",
  "frontend/src/hooks/useBooking.ts": "Custom hooks for adding and fetching booking records from the ICP backend, using React Query mutations and queries with actor-based authentication.",
  "frontend/src/hooks/useInstallPrompt.ts": "Custom hook that manages the PWA install prompt lifecycle, exposing install availability, installation state, and a function to trigger the browser's install dialog.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication, including login, logout, and persisted identity state via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend actor interactions including user profiles, admin checks, bookings, UPI payments, course details, attendance, discount codes, and visitor tracking.",
  "frontend/src/hooks/useRazorpay.ts": "Empty file, likely a placeholder for a Razorpay payment integration hook.",
  "frontend/src/index.css": "Global stylesheet importing Google Fonts and defining Tailwind base/component/utility layers with CSS custom properties for light/dark themes including navy, gold, and cream color tokens.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/types/booking.ts": "TypeScript interfaces for booking form data, booking records, and UPI payment parameters used across the booking flow.",
  "frontend/src/utils/pricingCalculator.ts": "Utility functions and constants for calculating per-class prices by service and class type, applying tiered discounts (10–35%) based on number of classes booked.",
  "frontend/src/utils/upiPayment.ts": "Utility for generating UPI deep link URLs with a hardcoded UPI ID and helper to detect mobile devices.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters from both query strings and hash-based routing, with sessionStorage fallback support.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom colors (navy, gold, cream), fonts (Playfair Display, Inter), border radii, box shadows, and accordion animations.",
  "project_state.json": "Project state metadata describing current features, pending feature requests (discount code integration and opaque dropdowns), architectural notes, and known issues for the Rajat's Equation portal."
}