{
  "backend/main.mo": "Main Motoko actor for the mathematics learning platform, defining all core types (MathProblem, Booking, UserProfile, CourseSession, etc.) and including mixins for storage, authorization, Stripe, and HTTP outcalls.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs and titles (design system, hero redesign, header redesign, etc.) to their associated files, components, test IDs, and confidence levels for build planning.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend source files, describing the purpose and key details of each component, hook, and configuration file in the project.",
  "frontend/index.css": "Base Tailwind CSS entry file defining OKLCH-based CSS custom properties for light and dark theme tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "HTML entry point for the Vite/React app, setting the page title to 'Rajat's Equation - Master Mathematical Thinking' and including PWA meta tags and manifest link.",
  "frontend/public/manifest.json": "PWA manifest for 'Rajat's Equation - Mathematics Platform' specifying app name, theme color, icons, display mode, and categories.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets and network-first for API calls, with install, activate, and fetch event handlers for PWA offline support.",
  "frontend/src/App.tsx": "Root React component managing view navigation, authentication state, admin checks, and profile setup flow, rendering the appropriate page component based on the current view.",
  "frontend/src/components/AdminDashboard.tsx": "Main admin dashboard component with a sidebar navigation and tab-based content area, rendering sub-components for students, attendance, support, enquiries, materials, sessions, discounts, and analytics.",
  "frontend/src/components/AdminEnquiriesTab.tsx": "Admin tab for viewing and managing course enquiries, supporting expand/collapse per enquiry and confirm/reject actions with status badges.",
  "frontend/src/components/AdminSupportMessages.tsx": "Admin view for reading and replying to student support message threads, with expandable thread cards and an inline reply form.",
  "frontend/src/components/AttendanceManager.tsx": "Admin component for marking and tracking student attendance, displaying a searchable table of bookings with present/absent action buttons.",
  "frontend/src/components/AuthGate.tsx": "Wrapper component that intercepts click events and shows a login modal if the user is not authenticated, otherwise passing the action through.",
  "frontend/src/components/BookedStudentsSection.tsx": "Admin section listing all booked students in a searchable table, with drill-down navigation to a detailed per-student view.",
  "frontend/src/components/BookingConfirmation.tsx": "Displays a booking confirmation screen with a success icon and a summary of booking details including name, phone, service, date, time, class type, discount, and final amount.",
  "frontend/src/components/BookingFlowManager.tsx": "Manages a multi-step booking dialog flow (form → payment → confirmation), coordinating state between BookingForm, UpiPaymentStep, and BookingConfirmation components.",
  "frontend/src/components/BookingForm.tsx": "A form component for collecting booking details (name, phone, service, class type, number of classes, date, time) and calculating pricing before submission.",
  "frontend/src/components/ClassSessionsManager.tsx": "Admin component for managing course sessions, allowing selection of a course and adding or deleting sessions with title, date, time, and Google Meet/Calendar links.",
  "frontend/src/components/CompletedSessions.tsx": "Displays a list of completed tutoring bookings fetched via a query hook, showing student details, service, date, classes, amount, and optional access code.",
  "frontend/src/components/CourseMaterialsManager.tsx": "Admin component for managing course materials per course, supporting adding and deleting materials with a title, type (pdf/video/note/link), and URL.",
  "frontend/src/components/CourseOffering.tsx": "Displays a course card with title, description, and price, and provides a UPI payment dialog where authenticated users can submit a transaction reference ID to enroll.",
  "frontend/src/components/DiscountCodeManager.tsx": "Admin panel component for managing discount codes, showing hardcoded built-in codes in a table and allowing generation of new random codes with a specified discount percentage.",
  "frontend/src/components/EnrollmentCTA.tsx": "Marketing section that lists learning benefits and renders a booking CTA button, redirecting unauthenticated users to a login modal before opening the booking flow.",
  "frontend/src/components/Footer.tsx": "Site footer displaying brand info, quick navigation links, contact details, and social media icons (WhatsApp, YouTube) with hover effects.",
  "frontend/src/components/Header.tsx": "Fixed top navigation header with logo, desktop and mobile nav links, scroll-based shadow, and conditional admin link visibility based on user identity.",
  "frontend/src/components/Hero.tsx": "Renders the main hero section with an animated math-symbol background, stats, and CTA buttons that open booking or enquiry flows based on authentication and admin status.",
  "frontend/src/components/LoginButton.tsx": "A button component that handles Internet Identity login and logout, clearing the query cache and redirecting on logout.",
  "frontend/src/components/LoginModal.tsx": "A dialog modal prompting unauthenticated users to sign in via Internet Identity, with loading and cancel states.",
  "frontend/src/components/PaymentEnquiryForm.tsx": "A form for submitting payment enquiries that generates a reference ID, validates inputs, calls the addPaymentEnquiry mutation, and displays a UPI QR code on success.",
  "frontend/src/components/ProblemGenerator.tsx": "Empty file with no content.",
  "frontend/src/components/ProfileSetup.tsx": "A first-time profile setup card that collects the user's name and saves it via the saveCallerUserProfile mutation.",
  "frontend/src/components/ProgressTracker.tsx": "Empty file with no content.",
  "frontend/src/components/QRCheckInView.tsx": "An admin QR check-in interface that supports camera scanning or manual token entry, validates the token against the backend, and confirms student check-in.",
  "frontend/src/components/Services.tsx": "Displays a grid of tutoring service cards (JEE, boards, olympiad, etc.) with pricing and features, and opens booking or enquiry modals on CTA clicks.",
  "frontend/src/components/StudentAttendanceView.tsx": "Displays a student's attendance records and summary (total, present, rate) for the last 90 days using data from query hooks, with a progress bar and per-record present/absent badges.",
  "frontend/src/components/StudentDashboard.tsx": "Student-facing dashboard showing assigned sessions and learning materials in tabs, with login prompt for unauthenticated users and stats for session/material counts.",
  "frontend/src/components/StudentDetailView.tsx": "Admin/tutor view for managing an individual student's sessions, materials, and meeting links, with forms to add/delete each and inline editing for meeting link details.",
  "frontend/src/components/StudentEnquiryForm.tsx": "Public form for prospective students to submit an enquiry (name, contact, course interest, message), displaying a confirmation screen with a copyable enquiry ID on success.",
  "frontend/src/components/StudentEnquiryPortal.tsx": "Allows students to look up their enquiry status by ID, displaying pending/confirmed/rejected state with appropriate icons and styling.",
  "frontend/src/components/StudentMaterialsTab.tsx": "Tab component for listing and managing course materials (PDF, video, note, link) for a given course, with add and delete functionality and type-colored badges.",
  "frontend/src/components/StudentPortal.tsx": "Student portal entry component that authenticates students via an access code, then renders tabbed views for materials, schedule, support, and attendance.",
  "frontend/src/components/StudentScheduleTab.tsx": "Tab component for managing a student's scheduled sessions, supporting adding/deleting sessions and inline editing of meeting links with platform selection.",
  "frontend/src/components/StudentSupportView.tsx": "Support messaging view that lets students submit messages to their instructor and view threaded replies with timestamps.",
  "frontend/src/components/UpiPaymentStep.tsx": "UPI payment step component that displays a booking summary, handles discount code validation, generates a QR code and deep-link for payment, and confirms the final amount.",
  "frontend/src/components/VisitorTrackingView.tsx": "Admin view that displays visitor activity stats (total bookings, login events, course views) using booking records, with a placeholder for a missing aggregated activity endpoint.",
  "frontend/src/config/razorpay.ts": "Empty configuration file intended for Razorpay payment gateway settings.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using the user's Internet Identity, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useBooking.ts": "Custom hooks for adding and fetching booking records from the backend actor, built on React Query mutations and queries.",
  "frontend/src/hooks/useInstallPrompt.ts": "React hook that manages PWA installation state, listening for the `beforeinstallprompt` and `appinstalled` browser events and exposing `canInstall`, `isInstalled`, and an `installApp` trigger.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an `InternetIdentityProvider` context and `useInternetIdentity` hook that wrap DFINITY's AuthClient to handle ICP Internet Identity login, logout, and identity persistence with status tracking.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend actor calls, covering user profiles, admin checks, booking records (CRUD, status updates, payment marking), and other data operations.",
  "frontend/src/hooks/useRazorpay.ts": "Empty file with no content.",
  "frontend/src/index.css": "Global stylesheet that imports Google Fonts, configures Tailwind CSS layers, and defines a premium Navy/White/Gold design token system with light/dark mode CSS variables and reusable component utility classes.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with `QueryClientProvider` and `InternetIdentityProvider` wrapping the root `App` component.",
  "frontend/src/types/booking.ts": "TypeScript type definitions for booking-related data structures: `BookingFormData`, `BookingRecord`, and `UpiPaymentParams`.",
  "frontend/src/utils/pricingCalculator.ts": "Exports pricing tables for one-on-one and group classes per service type, discount tiers by class count, and helper functions to compute per-class price, discount percentage, and final booking amount.",
  "frontend/src/utils/upiPayment.ts": "Utility that generates a UPI deep-link URL for a hardcoded UPI ID and provides a helper to detect mobile devices.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to `sessionStorage`, and cleaning sensitive parameters from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with a navy/gold/cream color palette, custom font families (Playfair Display, Inter), typography scale, border radii, box shadows, and animations. Includes plugins for tailwindcss-animate, @tailwindcss/typography, and @tailwindcss/container-queries.",
  "project_state.json": "Tracks the current state of a premium math-education platform project at schema version 3, documenting the deep navy/white/gold design system, math-themed visual elements, existing implemented features, known issues, and required image assets."
}