{
  "kind": "build_request",
  "title": "Add Attendance Tracking, Discount Code Generator, and Unpurchased Visitor Tracking",
  "projectName": "Rajat's Equation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add an Attendance data model to the backend that stores class sessions per student/booking with a present/absent status. Admin can mark students present or absent for each session. Store session date, course/booking reference, and attendance status per student.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Admin manually marks students present/absent per class session"
        ]
      },
      "acceptanceCriteria": [
        "Backend stores attendance records keyed by booking/student and session",
        "Admin can mark a student as present or absent for a specific session",
        "Attendance records are persisted in stable storage"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Expose backend query functions that return attendance records filterable by date range, showing total classes held in that range and how many a student attended, including an attendance rate percentage.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Filter by date range to see how many classes occurred and attendance rate"
        ]
      },
      "acceptanceCriteria": [
        "Query accepts start and end date parameters",
        "Returns count of total sessions in range, attended sessions, and attendance rate",
        "Admin can query for any student; student can only query their own records"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Add an Attendance section to the Admin Dashboard that lists enrolled students, allows the admin to select a student, choose a date range, and mark each session in that range as present or absent. Display total classes held, attended, and attendance rate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Admin manually marks students present/absent per class session",
          "Filter by date range"
        ]
      },
      "acceptanceCriteria": [
        "Admin can select a student and a date range",
        "Sessions in the range are listed with present/absent toggle controls",
        "Summary shows total classes, attended count, and attendance rate percentage",
        "Changes are saved to the backend"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Add an Attendance tab to the Student Portal that shows the authenticated student's own attendance records. Include a date-range filter and display total classes held vs attended with attendance rate.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Students can view their own attendance records",
          "Filter by date range to see how many classes occurred and attendance rate"
        ]
      },
      "acceptanceCriteria": [
        "Attendance tab is visible only to the logged-in student for their own records",
        "Date-range filter controls are provided",
        "Displays total sessions, attended sessions, and attendance rate"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Add a DiscountCode data model to the backend with fields: code string, percentage (0–100), isActive boolean, isUsed boolean, and usedByPrincipal. Provide admin functions to generate a new single-use percentage-based discount code, list all codes, and deactivate a code.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Admin generates single-use, percentage-based codes (0–100%)",
          "Admin dashboard to view, manage, and deactivate codes"
        ]
      },
      "acceptanceCriteria": [
        "Discount code records are persisted in stable storage",
        "Admin can generate a new code with a specified percentage (0–100)",
        "Admin can deactivate any active code",
        "A code can only be used once; after use it is marked as used"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Add a backend function to validate and apply a discount code at checkout. It should verify the code is active and unused, return the discount percentage, and mark it as used (tied to the purchasing user's principal) when a booking/purchase is confirmed.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Codes applied at course checkout"
        ]
      },
      "acceptanceCriteria": [
        "Returns an error if code is invalid, already used, or deactivated",
        "Returns the discount percentage for a valid code",
        "Marks the code as used with the buyer's principal upon successful purchase"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Add a Discount Codes section to the Admin Dashboard where the admin can generate new single-use percentage-based codes, view all codes with their status (active, used, deactivated), and deactivate any active code.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Admin dashboard to view, manage, and deactivate codes"
        ]
      },
      "acceptanceCriteria": [
        "Admin can input a percentage and generate a new code",
        "Generated code is displayed and copyable",
        "Table/list shows all codes with percentage, status, and used-by info",
        "Deactivate button disables an active code"
      ]
    },
    {
      "id": "REQ-8",
      "text": "Integrate the discount code input into the booking/checkout flow (BookingForm or UpiPaymentStep). Allow the user to enter a discount code, validate it against the backend, and apply the percentage discount to the displayed total before confirming payment.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Codes applied at course checkout"
        ]
      },
      "acceptanceCriteria": [
        "Discount code input field is present in the checkout flow",
        "Valid code shows the discounted price; invalid code shows an error message",
        "Discounted amount is reflected in the booking confirmation and saved record"
      ]
    },
    {
      "id": "REQ-9",
      "text": "Add a VisitorActivity data model to the backend that records login events and course-view events for authenticated users who have not purchased a course. Store principal, timestamp, event type (login or courseView), and course ID (for view events).",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Tracks logged-in users' login activity and courses viewed without purchase",
          "Visible to admins only"
        ]
      },
      "acceptanceCriteria": [
        "Login events are recorded when an authenticated user accesses the platform",
        "Course-view events are recorded when an authenticated user views a course they have not purchased",
        "Records are stored in stable storage",
        "Only admin can query all visitor activity records"
      ]
    },
    {
      "id": "REQ-10",
      "text": "Trigger backend visitor activity logging from the frontend: record a login event when an authenticated user lands on the app, and record a course-view event when an authenticated user views a course detail they have not purchased.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Records login activity and courses viewed without purchase"
        ]
      },
      "acceptanceCriteria": [
        "Login activity is logged once per session on authentication",
        "Course view is logged each time an unpurchased course is viewed by an authenticated user",
        "Logging calls are silent (no user-facing feedback)"
      ]
    },
    {
      "id": "REQ-11",
      "text": "Add an Unpurchased Visitor Tracking section to the Admin Dashboard showing a table of logged-in users who have not purchased, with columns for user principal/name (if available), login timestamps, and list of courses viewed without purchase.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-10"
        ],
        "quotes": [
          "Admin-only dashboard to review this data"
        ]
      },
      "acceptanceCriteria": [
        "Section is visible only to admins",
        "Table lists each tracked user with their login history and viewed courses",
        "Data is fetched from the backend and displayed in a readable format"
      ]
    }
  ],
  "constraints": [
    "All backend logic must remain in the single main actor (backend/main.mo)",
    "Attendance, discount code, and visitor tracking data must use stable storage for persistence across upgrades",
    "Discount codes are single-use only — once applied they cannot be reused",
    "Visitor tracking and discount code management are admin-only features",
    "Students can only view their own attendance data"
  ],
  "nonGoals": [
    "Automatic attendance marking based on login or activity — attendance is manually set by admin only",
    "Anonymous/guest visitor tracking — only authenticated (Internet Identity) users are tracked",
    "Multi-use or time-expiring discount codes",
    "Email or push notifications for attendance or discount codes",
    "Bulk attendance import/export"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}