{
  "kind": "build_request",
  "title": "Full Premium UI Redesign — Landing Page, Admin Dashboard & Student Portal",
  "projectName": "Rajat's Equation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Establish a consistent global design system across the entire app using a deep navy (#0B1B3E), white, and gold (#C9A84C) color palette. Update CSS custom properties in frontend/src/index.css to reflect these brand colors, ensuring all existing Tailwind utility classes and component tokens map to the new palette. Apply Playfair Display for headings and Inter for body text with a clear font-size hierarchy (Title → Subtitle → Body → Caption). Remove any clutter, random shapes, or distracting decorative elements from shared layout areas.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-7"
        ]
      },
      "acceptanceCriteria": [
        "CSS variables for navy, white, and gold are defined and used throughout the app",
        "Playfair Display is used for all major headings; Inter for body copy",
        "Font sizes follow a clear hierarchy: H1 > H2 > H3 > body > caption",
        "No random decorative shapes or distracting elements appear in shared layout areas",
        "Color contrast meets readable thresholds against both light and dark backgrounds"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Redesign the Hero section in frontend/src/components/Hero.tsx with an elegant mathematics-themed background featuring soft, low-opacity math symbols (Σ, √, θ, ∫, π, ∞, and equation fragments) rendered as decorative SVG or CSS elements that do not reduce text readability. Improve the layout balance between the hero text and any accompanying image/visual. Apply a strong heading style to the main title, a clean readable style to the subtitle/description, and ensure call-to-action buttons are modern, consistently sized, and have smooth hover effects with gold accent highlights.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-7"
        ]
      },
      "acceptanceCriteria": [
        "Hero background shows subtle math symbols/equations at low opacity that do not obscure text",
        "Main hero title uses Playfair Display in a prominent size with high contrast",
        "CTA buttons have consistent padding, rounded corners, gold accent color, and smooth hover transitions",
        "Hero layout is balanced and visually calm with proper whitespace",
        "Text readability is not compromised by background elements"
      ]
    },
    {
      "id": "REQ-3",
      "text": "Redesign the Header in frontend/src/components/Header.tsx. Remove unnecessary empty boxes or distracting elements. Improve spacing, margins, and alignment. Ensure the sticky nav has a clean background (navy or white with subtle shadow), consistent icon style, and modern nav links with hover effects. Logo and brand name should be visually prominent. Mobile nav should be clean and accessible.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-7"
        ]
      },
      "acceptanceCriteria": [
        "Header has no empty boxes or extraneous visual noise",
        "Nav links have consistent spacing and smooth hover/active state styling",
        "Sticky header shows a subtle shadow separating it from page content",
        "Logo and brand name are clearly visible and properly sized",
        "Mobile hamburger menu is clean and functional"
      ]
    },
    {
      "id": "REQ-4",
      "text": "Redesign all remaining landing page sections — Services (frontend/src/components/Services.tsx), EnrollmentCTA (frontend/src/components/EnrollmentCTA.tsx), and Footer (frontend/src/components/Footer.tsx) — using the premium navy/white/gold design system. Apply clean card layouts with soft box shadows and rounded corners to course/service cards. Ensure sections are visually separated with balanced whitespace. Buttons should match the global modern button style. Footer should be clean and well-structured with proper typographic hierarchy.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-7"
        ]
      },
      "acceptanceCriteria": [
        "Service/course cards use soft shadows, rounded corners, and gold accent highlights",
        "Sections are clearly separated with generous but balanced vertical spacing",
        "All buttons on the landing page are consistent in size, style, and hover behavior",
        "Footer is clean, readable, and well-structured",
        "No section feels cluttered or visually unbalanced"
      ]
    },
    {
      "id": "REQ-5",
      "text": "Redesign the Admin Dashboard (frontend/src/components/AdminDashboard.tsx) and all its child tab components (BookedStudentsSection, AttendanceManager, AdminSupportMessages, AdminEnquiriesTab, CourseMaterialsManager, ClassSessionsManager, DiscountCodeManager, VisitorTrackingView, StudentDetailView) using the premium design system. The sidebar should use a deep navy background with gold active-state indicators. Tab content areas should use white/off-white card backgrounds with soft shadows. Tables, lists, and form elements should have improved spacing, alignment, and visual hierarchy. Buttons and badges must follow the global style.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-7"
        ]
      },
      "acceptanceCriteria": [
        "Admin sidebar uses deep navy background with gold-highlighted active tab",
        "All tab content areas use white card backgrounds with soft shadows",
        "Tables and lists have consistent row spacing, borders, and typography hierarchy",
        "Form inputs and buttons inside tabs match the global modern style",
        "Status badges and labels use consistent color-coding aligned with the palette"
      ]
    },
    {
      "id": "REQ-6",
      "text": "Redesign the Student Portal (frontend/src/components/StudentPortal.tsx) and all its child views (StudentDashboard, StudentScheduleTab, StudentMaterialsTab, StudentSupportView, StudentAttendanceView, StudentEnquiryPortal, ProfileSetup, QRCheckInView) using the premium design system. Tab navigation should use gold underline/active indicators. Content cards should use clean white backgrounds with soft shadows. Progress bars and attendance stats should use gold accent colors. Meeting link badges (Google Meet, Zoom, Zoho) should remain platform-colored but styled consistently within the card layout.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-7"
        ]
      },
      "acceptanceCriteria": [
        "Student portal tabs have gold underline or gold-fill active state",
        "All content sections use white card backgrounds with soft shadows and proper spacing",
        "Attendance progress bar uses gold accent color",
        "Meeting link badges are styled consistently within card layouts",
        "Forms and input fields use the global premium styling"
      ]
    },
    {
      "id": "REQ-7",
      "text": "Redesign modal and dialog components (BookingFlowManager, BookingForm, UpiPaymentStep, BookingConfirmation, LoginModal, PaymentEnquiryForm, StudentEnquiryForm, CourseOffering) to match the premium design system. Dialog containers should use white backgrounds with navy headers and gold accents. Form fields should have clean borders, proper label hierarchy, and smooth focus states. Confirmation screens should feel premium and celebratory using the palette.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4",
          "msg-6",
          "msg-7"
        ]
      },
      "acceptanceCriteria": [
        "All dialog/modal headers use navy or navy-gradient backgrounds with white/gold text",
        "Form inputs have consistent border radius, padding, and focus ring in gold",
        "Confirmation screens use navy/gold colors with clear success messaging",
        "Modals do not feel generic — they match the overall premium math education brand"
      ]
    }
  ],
  "constraints": [
    "Do not change any backend logic, data models, or Motoko files",
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui",
    "Do not add, remove, or reorder any existing page sections or features — redesign only",
    "All existing functionality (booking, authentication, admin management, student portal) must remain fully operational after redesign"
  ],
  "nonGoals": [
    "Adding new sections or features to any page",
    "Changing the backend schema or API",
    "Implementing dark mode toggle (unless already present)",
    "Replacing or modifying the Internet Identity authentication flow",
    "Changes to PWA manifest, service worker, or index.html"
  ],
  "imageRequirements": {
    "required": [
      "Mathematics-themed hero background with deep navy gradient, subtle low-opacity gold math symbols (Σ √ θ ∫ π ∞) and equation fragments scattered across the canvas (hero-math-bg.dim_1920x900.png)"
    ],
    "edits": []
  }
}