{
  "kind": "build_request",
  "title": "Connect discount codes to payment enquiry form and make dropdowns opaque",
  "projectName": "Rajat's Equation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add a discount code input field to the payment enquiry / booking form (UpiPaymentStep and BookingFlowManager) that allows users to enter admin-generated discount codes. When a valid code is entered, calculate and display the discounted price in real-time before submission. Include the discount code and final discounted price as part of the same form submission payload sent to the backend.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9",
          "msg-11"
        ],
        "quotes": [
          "yes the discounts codes that is generated by admin dashboard",
          "yes discount code field and pricing be the part of same form submission"
        ]
      },
      "acceptanceCriteria": [
        "A discount code text input is visible in the payment enquiry / booking form (UpiPaymentStep component)",
        "When a user enters a valid admin-generated discount code, the discounted price is calculated and displayed in real-time before submission",
        "Invalid or expired codes show a clear error message",
        "The discount code and resulting discounted price are included in the booking form submission payload",
        "The BookingConfirmation screen shows the applied discount code and discounted amount",
        "The backend validateDiscountCode (or equivalent) query is called to verify the code before applying it"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Make all dropdown menus throughout the portal (student portal, admin dashboard, booking forms, service selections, and any other dropdowns) fully opaque. Remove all transparency, glassmorphism, or backdrop-blur effects from dropdown menus so they have a solid, opaque background.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-9",
          "msg-11"
        ],
        "quotes": [
          "keep all dropdown menus opaque in the portal not transparent"
        ]
      },
      "acceptanceCriteria": [
        "All dropdown menus across the portal (service type, class type, date pickers, select inputs, etc.) have fully opaque backgrounds",
        "No dropdown menu uses a transparent, semi-transparent, or glassmorphism/backdrop-blur style",
        "Dropdowns use a solid background color consistent with the app's design system (navy/cream/gold tokens)",
        "The opaque styling applies in both light and dark mode where applicable",
        "Dropdown items remain clearly readable against the solid background"
      ]
    }
  ],
  "constraints": [
    "Discount code validation must use admin-generated codes stored in the backend — do not allow arbitrary client-side codes",
    "Do not alter immutable frontend paths: frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, frontend/src/components/ui"
  ],
  "nonGoals": [
    "Creating new discount code generation UI (already exists in DiscountCodeManager admin component)",
    "Changes to attendance tracking or visitor tracking features",
    "Changes to backend discount code storage or generation logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}