{
  "kind": "build_request",
  "title": "Add RAJAT50 and MATHS30 discount codes",
  "projectName": "Rajat's Equation",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Add two new discount codes to the discount code validation logic in UpiPaymentStep.tsx: RAJAT50 (50% discount) and MATHS30 (30% discount). These must work alongside the existing SAVE10 (10%) and SUMMER20 (20%) codes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "RAJAT50 AS 50% DISCOUNT",
          "MATHS30 AS 30% DISCOUNT"
        ]
      },
      "acceptanceCriteria": [
        "Entering RAJAT50 in the discount code field applies a 50% discount to the booking total",
        "Entering MATHS30 in the discount code field applies a 30% discount to the booking total",
        "Existing codes SAVE10 (10%) and SUMMER20 (20%) continue to work correctly",
        "Invalid codes still show an appropriate error message",
        "The discounted final amount is correctly reflected in the payment summary and booking confirmation"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Update the DiscountCodeManager admin UI to display RAJAT50 (50%) and MATHS30 (30%) alongside the existing discount codes so admins can see all active codes.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "RAJAT50 AS 50% DISCOUNT",
          "MATHS30 AS 30% DISCOUNT"
        ]
      },
      "acceptanceCriteria": [
        "Admin discount codes panel lists RAJAT50 with 50% label",
        "Admin discount codes panel lists MATHS30 with 30% label",
        "All four codes (SAVE10, SUMMER20, RAJAT50, MATHS30) are visible in the admin view"
      ]
    }
  ],
  "constraints": [
    "Do not remove or modify existing discount codes SAVE10 (10%) and SUMMER20 (20%)",
    "Discount code validation logic resides in frontend/src/components/UpiPaymentStep.tsx — update only that file's code list"
  ],
  "nonGoals": [
    "Storing discount codes in the backend canister",
    "Adding any new discount codes beyond RAJAT50 and MATHS30",
    "Changing the discount application or pricing calculation logic"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}