{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add RAJAT50 and MATHS30 discount codes",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add RAJAT50 (50%) and MATHS30 (30%) discount codes to UpiPaymentStep validation logic alongside existing codes",
      "acceptanceCriteria": [
        "Entering RAJAT50 in the discount code field applies a 50% discount to the booking total",
        "Entering MATHS30 in the discount code field applies a 30% discount to the booking total",
        "Existing codes SAVE10 (10%) and SUMMER20 (20%) continue to work correctly",
        "Invalid codes still show an appropriate error message",
        "The discounted final amount is correctly reflected in the payment summary and booking confirmation"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/UpiPaymentStep.tsx",
          "operation": "modify",
          "description": "Update the discount code validation logic to include two new codes: RAJAT50 with 50% discount and MATHS30 with 30% discount. Extend the existing validDiscountCodes object (currently containing SAVE10: 10 and SUMMER20: 20) to include RAJAT50: 50 and MATHS30: 30. Ensure the validation, discount calculation, and final amount display logic correctly handle all four codes."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Update DiscountCodeManager admin UI to display RAJAT50 and MATHS30 alongside existing codes",
      "acceptanceCriteria": [
        "Admin discount codes panel lists RAJAT50 with 50% label",
        "Admin discount codes panel lists MATHS30 with 30% label",
        "All four codes (SAVE10, SUMMER20, RAJAT50, MATHS30) are visible in the admin view"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DiscountCodeManager.tsx",
          "operation": "modify",
          "description": "Update the admin discount code display to include RAJAT50 (50%) and MATHS30 (30%) in the list of active discount codes. Ensure the UI renders all four codes (SAVE10, SUMMER20, RAJAT50, MATHS30) with their corresponding discount percentages and active/inactive status indicators. The display should clearly show each code's name and discount percentage for admin visibility."
        }
      ]
    }
  ]
}