{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Add Attendance Tracking, Discount Code Generator, and Unpurchased Visitor Tracking",
  "requirements": [
    {
      "id": "REQ-3",
      "summary": "Add Attendance section to Admin Dashboard for marking student attendance with date range filtering and attendance rate display",
      "acceptanceCriteria": [
        "Admin can select a student and a date range",
        "Sessions in the range are listed with present/absent toggle controls",
        "Summary shows total classes, attended count, and attendance rate percentage",
        "Changes are saved to the backend"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/AttendanceManager.tsx",
          "operation": "create",
          "description": "Create admin attendance management component allowing admin to select a student from enrolled bookings, choose a date range, list sessions with present/absent toggle controls, and display attendance summary (total classes, attended, rate). Use backend capabilities getAttendanceRecords, getAttendanceSummary, and markAttendance. Include date pickers, student selector dropdown, session list with checkboxes, and summary statistics panel."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for attendance operations: useGetAttendanceRecords (accepts student, course, startDate, endDate), useGetAttendanceSummary (same params), and useMarkAttendance mutation. These hooks call the corresponding backend capabilities and handle query invalidation on successful mutations."
        },
        {
          "path": "frontend/src/components/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a new 'Attendance' tab to the admin dashboard tabs array. Wire the AttendanceManager component to render when the Attendance tab is selected. Ensure the tab is visible and accessible alongside existing tabs (Course Materials, Class Sessions, Support Messages)."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Add Attendance tab to Student Portal showing authenticated student's attendance records with date-range filter and attendance rate",
      "acceptanceCriteria": [
        "Attendance tab is visible only to the logged-in student for their own records",
        "Date-range filter controls are provided",
        "Displays total sessions, attended sessions, and attendance rate"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/StudentAttendanceView.tsx",
          "operation": "create",
          "description": "Create student-facing attendance view component that displays the authenticated user's own attendance records. Include date range filter controls (start and end date pickers), fetch records using backend capability getAttendanceRecords with the caller's principal, and display a summary showing total sessions, attended count, and attendance rate percentage. Show a list or table of individual sessions with dates and present/absent status."
        },
        {
          "path": "frontend/src/components/StudentPortal.tsx",
          "operation": "modify",
          "description": "Add a new 'Attendance' tab to the tabbed interface in the Student Portal. Wire the StudentAttendanceView component to render when the Attendance tab is selected. Ensure the tab is accessible after the student has looked up their booking via access code and is authenticated."
        }
      ]
    },
    {
      "id": "REQ-7",
      "summary": "Add Discount Codes section to Admin Dashboard for generating, viewing, and managing single-use percentage-based discount codes",
      "acceptanceCriteria": [
        "Admin can input a percentage and generate a new code",
        "Generated code is displayed and copyable",
        "Table/list shows all codes with percentage, status, and used-by info",
        "Deactivate button disables an active code"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/DiscountCodeManager.tsx",
          "operation": "create",
          "description": "Create admin discount code management component with a form to input discount percentage (0-100) and generate a new code via a backend capability (not yet defined in backend-interface, assume it exists or will be added). Display the generated code in a copyable text field. Show a table of all codes fetched via getActiveDiscountCodes, displaying code string, percentage, isActive/isUsed status, and usedBy principal. Provide a deactivate button for each active code that calls setDiscountCodeActiveState with isActive=false."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add React Query hooks for discount code operations: useGetActiveDiscountCodes query to fetch all codes, useGenerateDiscountCode mutation (assuming backend provides a generateDiscountCode function), and useSetDiscountCodeActiveState mutation. Handle query invalidation on successful mutations to refresh the code list."
        },
        {
          "path": "frontend/src/components/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a new 'Discount Codes' tab to the admin dashboard tabs array. Wire the DiscountCodeManager component to render when the Discount Codes tab is selected. Ensure the tab is visible and accessible alongside existing tabs."
        }
      ]
    },
    {
      "id": "REQ-8",
      "summary": "Integrate discount code input into booking/checkout flow allowing users to apply percentage discounts before payment",
      "acceptanceCriteria": [
        "Discount code input field is present in the checkout flow",
        "Valid code shows the discounted price; invalid code shows an error message",
        "Discounted amount is reflected in the booking confirmation and saved record"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/UpiPaymentStep.tsx",
          "operation": "modify",
          "description": "Add a discount code input field above the booking summary. Include an 'Apply' button that calls the backend capability validateAndApplyDiscountCode with the entered code. On success, display the discount percentage and update the displayed final amount by applying the discount. On error, show an inline error message (e.g., 'Invalid or already used code'). Store the discount percentage and discounted amount in component state and pass it to the confirmation step."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useValidateDiscountCode mutation hook that calls the backend capability validateAndApplyDiscountCode, returning the discount percentage on success or an error on failure. This hook is used in UpiPaymentStep to validate codes before applying them."
        },
        {
          "path": "frontend/src/components/BookingConfirmation.tsx",
          "operation": "modify",
          "description": "Update the booking confirmation display to show the discount percentage applied (if any) and the final discounted amount. Ensure the booking record saved via the backend includes the discountApplied field populated with the validated discount percentage."
        },
        {
          "path": "frontend/src/components/BookingFlowManager.tsx",
          "operation": "modify",
          "description": "Ensure the discount code and discounted amount are passed through the booking flow steps. When saving the booking record, include the discountApplied field with the discount percentage obtained from the UPI payment step. Verify that the finalAmount reflects the discounted price."
        }
      ]
    },
    {
      "id": "REQ-10",
      "summary": "Trigger backend visitor activity logging from frontend for login and course-view events for authenticated users",
      "acceptanceCriteria": [
        "Login activity is logged once per session on authentication",
        "Course view is logged each time an unpurchased course is viewed by an authenticated user",
        "Logging calls are silent (no user-facing feedback)"
      ],
      "file_operations": [
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Add a useEffect hook that triggers once per session when the user authenticates successfully. Call the backend capability trackVisitorActivity with eventType='login' and courseId=null. Use a sessionStorage flag to ensure this is logged only once per browser session, not on every re-render."
        },
        {
          "path": "frontend/src/components/CourseOffering.tsx",
          "operation": "modify",
          "description": "Add logic to detect when an authenticated user views a course they have not purchased. Use the hasPurchasedCourse field from the user profile or check via backend capability hasPaidWithUPI. If the user is authenticated and has not purchased, call trackVisitorActivity with eventType='courseView' and the courseId (use a consistent identifier for the course, e.g., course title or slug). Log silently without user-facing feedback."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useTrackVisitorActivity mutation hook that calls the backend capability trackVisitorActivity with eventType and courseId parameters. This hook is invoked silently from App.tsx on login and from CourseOffering.tsx on course view. No query invalidation or user feedback is required."
        }
      ]
    },
    {
      "id": "REQ-11",
      "summary": "Add Unpurchased Visitor Tracking section to Admin Dashboard showing logged-in users without purchases, their login history, and viewed courses",
      "acceptanceCriteria": [
        "Section is visible only to admins",
        "Table lists each tracked user with their login history and viewed courses",
        "Data is fetched from the backend and displayed in a readable format"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/VisitorTrackingView.tsx",
          "operation": "create",
          "description": "Create admin-only component that fetches and displays visitor activity data for unpurchased users. Call backend capability getVisitorActivitiesByUser for each tracked user (or a summary endpoint if available). Display a table with columns: user principal (or name if available via getUserProfile), login timestamps (list all login events), and viewed courses (list all courseView events with course IDs). Use a card or accordion layout for readability if the data is extensive."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a useGetVisitorActivities query hook that fetches visitor activity data from the backend. If the backend provides a summary endpoint listing all unpurchased visitors, use that; otherwise, fetch a list of tracked user principals and call getVisitorActivitiesByUser for each. Return structured data suitable for rendering in VisitorTrackingView."
        },
        {
          "path": "frontend/src/components/AdminDashboard.tsx",
          "operation": "modify",
          "description": "Add a new 'Visitor Tracking' tab to the admin dashboard tabs array. Wire the VisitorTrackingView component to render when the Visitor Tracking tab is selected. Ensure the tab is visible and accessible only to admins, alongside existing tabs."
        }
      ]
    }
  ]
}