{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Connect discount codes to payment enquiry form and make dropdowns opaque",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Add discount code input field to payment enquiry / booking form with real-time validation, discounted price display, and form submission integration",
      "acceptanceCriteria": [
        "A discount code text input is visible in the payment enquiry / booking form (UpiPaymentStep component)",
        "When a user enters a valid admin-generated discount code, the discounted price is calculated and displayed in real-time before submission",
        "Invalid or expired codes show a clear error message",
        "The discount code and resulting discounted price are included in the booking form submission payload",
        "The BookingConfirmation screen shows the applied discount code and discounted amount",
        "The backend validateDiscountCode (or equivalent) query is called to verify the code before applying it"
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new React Query mutation hook `useValidateAndApplyDiscountCode` that calls the backend `validateAndApplyDiscountCode` method. This hook will enable real-time discount code validation and return the discount percentage when a code is valid."
        },
        {
          "path": "frontend/src/components/UpiPaymentStep.tsx",
          "operation": "modify",
          "description": "Add a discount code input field above the booking summary. Implement state management for the discount code input, validation status, and applied discount percentage. When the user enters a code and clicks 'Apply', call the `useValidateAndApplyDiscountCode` mutation hook to validate the code with the backend. On success, recalculate and display the discounted price in real-time. Show clear error messages for invalid or expired codes. Update the component to pass the discount code and final discounted amount to the parent component via the onSubmit callback."
        },
        {
          "path": "frontend/src/components/BookingFlowManager.tsx",
          "operation": "modify",
          "description": "Update the state management to track the discount code and discounted amount received from UpiPaymentStep. Modify the handlePaymentSubmit function to include the discount code and final discounted amount in the booking record payload when calling addBookingRecord. Ensure these fields are passed through to BookingConfirmation for display."
        },
        {
          "path": "frontend/src/components/BookingConfirmation.tsx",
          "operation": "modify",
          "description": "Add UI elements to display the applied discount code (if any) and the discounted amount. Show a badge or label indicating the discount code used and the amount saved, positioned near the final amount display."
        },
        {
          "path": "frontend/src/types/booking.ts",
          "operation": "modify",
          "description": "Update the BookingFormData and BookingRecord interfaces to include optional `discountCode: string` and `discountPercent: number` fields to support discount tracking throughout the booking flow."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Make all dropdown menus fully opaque by removing transparency, glassmorphism, and backdrop-blur effects",
      "acceptanceCriteria": [
        "All dropdown menus across the portal (service type, class type, date pickers, select inputs, etc.) have fully opaque backgrounds",
        "No dropdown menu uses a transparent, semi-transparent, or glassmorphism/backdrop-blur style",
        "Dropdowns use a solid background color consistent with the app's design system (navy/cream/gold tokens)",
        "The opaque styling applies in both light and dark mode where applicable",
        "Dropdown items remain clearly readable against the solid background"
      ],
      "file_operations": [
        {
          "path": "frontend/src/index.css",
          "operation": "modify",
          "description": "Add global CSS rules targeting all dropdown-related selectors (select elements, shadcn/ui dropdown components like DropdownMenuContent, SelectContent, PopoverContent, etc.) to enforce fully opaque backgrounds. Use solid background colors from the design system CSS custom properties (--navy, --cream, --gold). Remove any existing backdrop-blur, transparency, or glassmorphism effects. Ensure these styles apply in both light and dark mode contexts using the appropriate CSS variable tokens."
        },
        {
          "path": "frontend/tailwind.config.js",
          "operation": "modify",
          "description": "Review and update the Tailwind configuration to ensure that dropdown-related components use solid, opaque background utilities. If necessary, add custom utility classes or extend the theme with dropdown-specific background overrides that enforce opacity: 1 and disable backdrop filters."
        }
      ]
    }
  ]
}