{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "Portal project with admin dashboard and user-facing features including attendance tracking, discount codes, visitor tracking, and payment enquiry forms. Currently implementing discount code integration in the payment enquiry form and opaque dropdown styling.",
  "architectural_notes": [
    "Discount codes are generated via the admin dashboard and must be validated against admin-created codes on the frontend payment enquiry form",
    "All dropdown menus should use fully opaque styling — no transparency or glassmorphism effects"
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-add-a-discount-code-input-field-to-the-payment-enquiry-booking-form-upipaymentstep-and-bookingflowmanager-that-allows-users-to-enter-admin-generated-discount-codes-when-a-valid-code-is-entered-calculate-and-display-the-discounted-price-in-real-time-before-submission-include-the-discount-code-and-final-discounted-price-as-part-of-the-same-form-submission-payload-sent-to-the-backend",
      "title": "Add a discount code input field to the payment enquiry / booking form (UpiPaymentStep and BookingFlowManager) that allows users to enter admin-generated discount codes. When a valid code is entered, calculate and display the discounted price in real-time before submission. Include the discount code and final discounted price as part of the same form submission payload sent to the backend.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-make-all-dropdown-menus-throughout-the-portal-student-portal-admin-dashboard-booking-forms-service-selections-and-any-other-dropdowns-fully-opaque-remove-all-transparency-glassmorphism-or-backdrop-blur-effects-from-dropdown-menus-so-they-have-a-solid-opaque-background",
      "title": "Make all dropdown menus throughout the portal (student portal, admin dashboard, booking forms, service selections, and any other dropdowns) fully opaque. Remove all transparency, glassmorphism, or backdrop-blur effects from dropdown menus so they have a solid, opaque background.",
      "reqIds": [
        "REQ-2"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Connect admin-generated discount codes to payment enquiry form with real-time price calculation and unified form submission",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Make all dropdown menus throughout the portal fully opaque (remove transparency/glassmorphism styling)",
      "reqIds": [],
      "status": "pending"
    }
  ],
  "gameProjectType": "none",
  "projectName": "Rajat's Equation",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}