{
  "backend/main.mo": "Main Motoko actor implementing a mathematics learning platform with problem management, user profiles, submissions tracking, progress stats, UPI payment handling, and role-based authorization (admin/user permissions).",
  "feature_evidence.json": "Feature evidence report documenting two features related to generating and displaying the Rajat's Equation logo in the Hero section with responsive sizing and proper positioning.",
  "frontend-file-summaries.txt": "Pre-existing summaries of frontend files including components for Hero, ProblemGenerator, ProgressTracker, Footer, authentication, profile setup, course offering, PWA configuration, and styling with Rajat's Equation branding.",
  "frontend/index.css": "Global Tailwind CSS styles with OKLCH color system defining CSS custom properties for light and dark themes, featuring dark navy blue primary brand colors and border/typography base styles.",
  "frontend/index.html": "HTML entry point with PWA meta tags, manifest link, apple-touch-icon references, navy blue theme color, and title \"Rajat's Equation - Master Mathematical Thinking\".",
  "frontend/public/manifest.json": "PWA manifest defining app metadata for \"Rajat's Equation - Mathematics Platform\" with standalone display mode, navy theme color, and references to generated app icons at 192x192 and 512x512 sizes.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, with install/activate/fetch event handlers for offline PWA functionality.",
  "frontend/src/App.tsx": "Root application component managing authentication state, profile setup flow, theme provider, and rendering Hero, Services, EnrollmentCTA, and Footer components with conditional ProfileSetup modal.",
  "frontend/src/components/CourseOffering.tsx": "Course purchase component displaying \"Comprehensive Mathematics Program\" with benefits list, UPI payment integration (9424135055@ptyes), authentication-gated access, and purchase status tracking.",
  "frontend/src/components/EnrollmentCTA.tsx": "Enrollment call-to-action component displaying benefits of the math program with cards and a UPI payment button. Features gradient backgrounds, benefit icons, and a trust badge.",
  "frontend/src/components/Footer.tsx": "Footer component with branding, social media links (WhatsApp, YouTube, LinkedIn), and attribution to caffeine.ai. Includes logo and copyright information.",
  "frontend/src/components/Hero.tsx": "Hero section component with logo, headline, description, and action buttons for enrollment and exploring programs. Includes optional PWA install button and hero banner image.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component using Internet Identity integration. Handles login/logout states with loading indicators and query cache clearing.",
  "frontend/src/components/ProblemGenerator.tsx": "Empty component file with no implementation.",
  "frontend/src/components/ProfileSetup.tsx": "Profile setup form component for new users to enter their name. Uses mutation hook to save user profile and displays welcome message on success.",
  "frontend/src/components/ProgressTracker.tsx": "Empty component file with no implementation.",
  "frontend/src/components/Services.tsx": "Services section component displaying six math program offerings in a grid layout. Each service card includes an icon, title, and description for different preparation courses.",
  "frontend/src/hooks/useActor.ts": "Custom hook managing backend actor creation with Internet Identity authentication. Handles actor lifecycle, query invalidation, and admin token initialization.",
  "frontend/src/hooks/useInstallPrompt.ts": "Custom hook for PWA installation functionality. Manages beforeinstallprompt event, tracks installation state, and provides installApp function.",
  "frontend/src/hooks/useInternetIdentity.ts": "React hook and provider for Internet Identity authentication on ICP, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for backend API calls including user profile management, course details retrieval, course purchase, and UPI payment recording/status checking.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom design tokens for light/dark themes using OKLCH color space, defining brand colors (navy), sidebar styles, and typography settings.",
  "frontend/src/main.tsx": "Application entry point that sets up React root with QueryClient and InternetIdentityProvider wrappers around the main App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom fonts (Inter, Georgia, Cal Sans), OKLCH-based color system with brand navy colors, container settings, and animation keyframes.",
  "project_state.json": "Project metadata describing a math edtech platform for Rajat's Equation, repositioned as marketing/enrollment site with UPI payment integration, multiple course offerings, and contact details."
}