{
  "backend/main.mo": "Main Motoko actor implementing JEE math problem management, user authentication with Internet Identity, submission tracking, progress statistics, course purchase integration with Stripe, and role-based access control for admin and user operations.",
  "feature_evidence.json": "Feature evidence report documenting PWA implementation including manifest file, service worker registration, meta tags, and install prompt functionality with associated test IDs and confidence levels.",
  "frontend-file-summaries.txt": "JSON-formatted summaries of all frontend files describing components, hooks, configuration, and PWA assets with their specific functionality and integration points.",
  "frontend/index.css": "Global Tailwind CSS styles defining OKLCH color system with warm earth tones (terracotta, sage, cream) for light and dark modes, including custom CSS variables for all UI elements.",
  "frontend/index.html": "HTML entry point with PWA meta tags (theme-color, apple-mobile-web-app settings), manifest link, and root div for React application mounting.",
  "frontend/public/manifest.json": "PWA manifest defining app metadata, standalone display mode, terracotta theme color, cream background, and icon configurations at 192x192 and 512x512 sizes for desktop installation.",
  "frontend/public/service-worker.js": "Service worker implementing cache-first strategy for static assets, network-first for API calls, install/activate lifecycle management, and offline fallback to index.html for navigation requests.",
  "frontend/src/App.tsx": "Root React component managing authentication state, profile setup flow, theme provider, and conditional rendering of Hero, CourseOffering, ProblemGenerator, ProgressTracker, and Footer with loading states.",
  "frontend/src/components/CourseOffering.tsx": "Displays a course purchase card with benefits, pricing, and purchase/login buttons. Handles course purchase flow with authentication checks and shows purchase status for authenticated users.",
  "frontend/src/components/Footer.tsx": "Renders the application footer with branding, copyright information, and a link to caffeine.ai with UTM tracking parameters.",
  "frontend/src/components/Hero.tsx": "Landing page hero section with headline, description, CTA buttons for starting JEE prep and tracking progress, plus PWA install prompt when available.",
  "frontend/src/components/LoginButton.tsx": "Authentication button component that toggles between login and logout states using Internet Identity, with loading states and query cache clearing on logout.",
  "frontend/src/components/ProblemGenerator.tsx": "Main problem-solving interface allowing users to select topic/difficulty, generate JEE math problems, submit step-by-step solutions with answer validation, and save attempts with time tracking.",
  "frontend/src/components/ProfileSetup.tsx": "First-time user onboarding form that collects the user's name and creates their profile in the system.",
  "frontend/src/components/ProgressTracker.tsx": "Displays user progress statistics including total problems solved, accuracy rate, topic-wise breakdown with progress bars, and premium membership badge for course purchasers.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and manages the backend actor instance with Internet Identity authentication, initializing access control and invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useInstallPrompt.ts": "React hook that manages PWA installation prompt state and provides methods to trigger app installation via the beforeinstallprompt event.",
  "frontend/src/hooks/useInternetIdentity.ts": "React context provider and hook for Internet Identity authentication, managing login state, identity persistence, and delegation validation with configurable AuthClient options.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for managing user progress, problem submissions, and validation with both local storage fallback and backend actor integration for math problem tracking.",
  "frontend/src/index.css": "Tailwind CSS configuration with custom CSS variables defining a warm earth-tone color palette (terracotta primary, sage green secondary) for both light and dark modes.",
  "frontend/src/main.tsx": "Application entry point that sets up React Query client and Internet Identity provider, then renders the root App component.",
  "frontend/src/utils/urlParams.ts": "Utility functions for extracting, persisting, and clearing URL parameters from both regular query strings and hash-based routing, with sessionStorage integration.",
  "frontend/tailwind.config.js": "Tailwind configuration defining custom color system using OKLCH color space, typography settings, container queries, animations, and design tokens for the UI theme.",
  "project_state.json": "Project state file tracking 15 versions of a JEE mathematics learning app with features for problem generation, progress tracking, and thinking-based math skills. Contains architectural notes, existing features, requirements, and image specifications using warm earth-tone design."
}